MikroElektronika/core_packages/PIC/XC8/def/PIC18LF66K40/mcu.h
extern volatile SMT1SIGPPSbits_t SMT1SIGPPSbits __at(0xE08);
// bitfield macros
#define _SMT1SIGPPS_PIN_POSN                                0x0
#define _SMT1SIGPPS_PIN_POSITION                            0x0
#define _SMT1SIGPPS_PIN_SIZE                                0x3
#define _SMT1SIGPPS_PIN_LENGTH                              0x3
#define _SMT1SIGPPS_PIN_MASK                                0x7
#define _SMT1SIGPPS_PORT_POSN                               0x3
#define _SMT1SIGPPS_PORT_POSITION                           0x3
#define _SMT1SIGPPS_PORT_SIZE                               0x3
#define _SMT1SIGPPS_PORT_LENGTH                             0x3
#define _SMT1SIGPPS_PORT_MASK                               0x38
#define _SMT1SIGPPS_SMT1SIGPPS_POSN                         0x0
#define _SMT1SIGPPS_SMT1SIGPPS_POSITION                     0x0
#define _SMT1SIGPPS_SMT1SIGPPS_SIZE                         0x6
#define _SMT1SIGPPS_SMT1SIGPPS_LENGTH                       0x6
#define _SMT1SIGPPS_SMT1SIGPPS_MASK                         0x3F
#define _SMT1SIGPPS_SMT1SIGPPS0_POSN                        0x0
#define _SMT1SIGPPS_SMT1SIGPPS0_POSITION                    0x0
#define _SMT1SIGPPS_SMT1SIGPPS0_SIZE                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS0_LENGTH                      0x1
#define _SMT1SIGPPS_SMT1SIGPPS0_MASK                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS1_POSN                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS1_POSITION                    0x1
#define _SMT1SIGPPS_SMT1SIGPPS1_SIZE                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS1_LENGTH                      0x1
#define _SMT1SIGPPS_SMT1SIGPPS1_MASK                        0x2
#define _SMT1SIGPPS_SMT1SIGPPS2_POSN                        0x2
#define _SMT1SIGPPS_SMT1SIGPPS2_POSITION                    0x2
#define _SMT1SIGPPS_SMT1SIGPPS2_SIZE                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS2_LENGTH                      0x1
#define _SMT1SIGPPS_SMT1SIGPPS2_MASK                        0x4
#define _SMT1SIGPPS_SMT1SIGPPS3_POSN                        0x3
#define _SMT1SIGPPS_SMT1SIGPPS3_POSITION                    0x3
#define _SMT1SIGPPS_SMT1SIGPPS3_SIZE                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS3_LENGTH                      0x1
#define _SMT1SIGPPS_SMT1SIGPPS3_MASK                        0x8
#define _SMT1SIGPPS_SMT1SIGPPS4_POSN                        0x4
#define _SMT1SIGPPS_SMT1SIGPPS4_POSITION                    0x4
#define _SMT1SIGPPS_SMT1SIGPPS4_SIZE                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS4_LENGTH                      0x1
#define _SMT1SIGPPS_SMT1SIGPPS4_MASK                        0x10
#define _SMT1SIGPPS_SMT1SIGPPS5_POSN                        0x5
#define _SMT1SIGPPS_SMT1SIGPPS5_POSITION                    0x5
#define _SMT1SIGPPS_SMT1SIGPPS5_SIZE                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS5_LENGTH                      0x1
#define _SMT1SIGPPS_SMT1SIGPPS5_MASK                        0x20

// Register: SMT2WINPPS
#define SMT2WINPPS SMT2WINPPS
extern volatile unsigned char           SMT2WINPPS          __at(0xE09);
#ifndef _LIB_BUILD
asm("SMT2WINPPS equ 0E09h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned SMT2WINPPS             :6;
    };
    struct {
        unsigned SMT2WINPPS0            :1;
        unsigned SMT2WINPPS1            :1;
        unsigned SMT2WINPPS2            :1;
        unsigned SMT2WINPPS3            :1;
        unsigned SMT2WINPPS4            :1;
        unsigned SMT2WINPPS5            :1;
    };
} SMT2WINPPSbits_t;
extern volatile SMT2WINPPSbits_t SMT2WINPPSbits __at(0xE09);
// bitfield macros
#define _SMT2WINPPS_PIN_POSN                                0x0
#define _SMT2WINPPS_PIN_POSITION                            0x0
#define _SMT2WINPPS_PIN_SIZE                                0x3
#define _SMT2WINPPS_PIN_LENGTH                              0x3
#define _SMT2WINPPS_PIN_MASK                                0x7
#define _SMT2WINPPS_PORT_POSN                               0x3
#define _SMT2WINPPS_PORT_POSITION                           0x3
#define _SMT2WINPPS_PORT_SIZE                               0x3
#define _SMT2WINPPS_PORT_LENGTH                             0x3
#define _SMT2WINPPS_PORT_MASK                               0x38
#define _SMT2WINPPS_SMT2WINPPS_POSN                         0x0
#define _SMT2WINPPS_SMT2WINPPS_POSITION                     0x0
#define _SMT2WINPPS_SMT2WINPPS_SIZE                         0x6
#define _SMT2WINPPS_SMT2WINPPS_LENGTH                       0x6
#define _SMT2WINPPS_SMT2WINPPS_MASK                         0x3F
#define _SMT2WINPPS_SMT2WINPPS0_POSN                        0x0
#define _SMT2WINPPS_SMT2WINPPS0_POSITION                    0x0
#define _SMT2WINPPS_SMT2WINPPS0_SIZE                        0x1
#define _SMT2WINPPS_SMT2WINPPS0_LENGTH                      0x1
#define _SMT2WINPPS_SMT2WINPPS0_MASK                        0x1
#define _SMT2WINPPS_SMT2WINPPS1_POSN                        0x1
#define _SMT2WINPPS_SMT2WINPPS1_POSITION                    0x1
#define _SMT2WINPPS_SMT2WINPPS1_SIZE                        0x1
#define _SMT2WINPPS_SMT2WINPPS1_LENGTH                      0x1
#define _SMT2WINPPS_SMT2WINPPS1_MASK                        0x2
#define _SMT2WINPPS_SMT2WINPPS2_POSN                        0x2
#define _SMT2WINPPS_SMT2WINPPS2_POSITION                    0x2
#define _SMT2WINPPS_SMT2WINPPS2_SIZE                        0x1
#define _SMT2WINPPS_SMT2WINPPS2_LENGTH                      0x1
#define _SMT2WINPPS_SMT2WINPPS2_MASK                        0x4
#define _SMT2WINPPS_SMT2WINPPS3_POSN                        0x3
#define _SMT2WINPPS_SMT2WINPPS3_POSITION                    0x3
#define _SMT2WINPPS_SMT2WINPPS3_SIZE                        0x1
#define _SMT2WINPPS_SMT2WINPPS3_LENGTH                      0x1
#define _SMT2WINPPS_SMT2WINPPS3_MASK                        0x8
#define _SMT2WINPPS_SMT2WINPPS4_POSN                        0x4
#define _SMT2WINPPS_SMT2WINPPS4_POSITION                    0x4
#define _SMT2WINPPS_SMT2WINPPS4_SIZE                        0x1
#define _SMT2WINPPS_SMT2WINPPS4_LENGTH                      0x1
#define _SMT2WINPPS_SMT2WINPPS4_MASK                        0x10
#define _SMT2WINPPS_SMT2WINPPS5_POSN                        0x5
#define _SMT2WINPPS_SMT2WINPPS5_POSITION                    0x5
#define _SMT2WINPPS_SMT2WINPPS5_SIZE                        0x1
#define _SMT2WINPPS_SMT2WINPPS5_LENGTH                      0x1
#define _SMT2WINPPS_SMT2WINPPS5_MASK                        0x20

// Register: SMT2SIGPPS
#define SMT2SIGPPS SMT2SIGPPS
extern volatile unsigned char           SMT2SIGPPS          __at(0xE0A);
#ifndef _LIB_BUILD
asm("SMT2SIGPPS equ 0E0Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned SMT2SIGPPS             :6;
    };
    struct {
        unsigned SMT2SIGPPS0            :1;
        unsigned SMT2SIGPPS1            :1;
        unsigned SMT2SIGPPS2            :1;
        unsigned SMT2SIGPPS3            :1;
        unsigned SMT2SIGPPS4            :1;
        unsigned SMT2SIGPPS5            :1;
    };
} SMT2SIGPPSbits_t;
extern volatile SMT2SIGPPSbits_t SMT2SIGPPSbits __at(0xE0A);
// bitfield macros
#define _SMT2SIGPPS_PIN_POSN                                0x0
#define _SMT2SIGPPS_PIN_POSITION                            0x0
#define _SMT2SIGPPS_PIN_SIZE                                0x3
#define _SMT2SIGPPS_PIN_LENGTH                              0x3
#define _SMT2SIGPPS_PIN_MASK                                0x7
#define _SMT2SIGPPS_PORT_POSN                               0x3
#define _SMT2SIGPPS_PORT_POSITION                           0x3
#define _SMT2SIGPPS_PORT_SIZE                               0x3
#define _SMT2SIGPPS_PORT_LENGTH                             0x3
#define _SMT2SIGPPS_PORT_MASK                               0x38
#define _SMT2SIGPPS_SMT2SIGPPS_POSN                         0x0
#define _SMT2SIGPPS_SMT2SIGPPS_POSITION                     0x0
#define _SMT2SIGPPS_SMT2SIGPPS_SIZE                         0x6
#define _SMT2SIGPPS_SMT2SIGPPS_LENGTH                       0x6
#define _SMT2SIGPPS_SMT2SIGPPS_MASK                         0x3F
#define _SMT2SIGPPS_SMT2SIGPPS0_POSN                        0x0
#define _SMT2SIGPPS_SMT2SIGPPS0_POSITION                    0x0
#define _SMT2SIGPPS_SMT2SIGPPS0_SIZE                        0x1
#define _SMT2SIGPPS_SMT2SIGPPS0_LENGTH                      0x1
#define _SMT2SIGPPS_SMT2SIGPPS0_MASK                        0x1
#define _SMT2SIGPPS_SMT2SIGPPS1_POSN                        0x1
#define _SMT2SIGPPS_SMT2SIGPPS1_POSITION                    0x1
#define _SMT2SIGPPS_SMT2SIGPPS1_SIZE                        0x1
#define _SMT2SIGPPS_SMT2SIGPPS1_LENGTH                      0x1
#define _SMT2SIGPPS_SMT2SIGPPS1_MASK                        0x2
#define _SMT2SIGPPS_SMT2SIGPPS2_POSN                        0x2
#define _SMT2SIGPPS_SMT2SIGPPS2_POSITION                    0x2
#define _SMT2SIGPPS_SMT2SIGPPS2_SIZE                        0x1
#define _SMT2SIGPPS_SMT2SIGPPS2_LENGTH                      0x1
#define _SMT2SIGPPS_SMT2SIGPPS2_MASK                        0x4
#define _SMT2SIGPPS_SMT2SIGPPS3_POSN                        0x3
#define _SMT2SIGPPS_SMT2SIGPPS3_POSITION                    0x3
#define _SMT2SIGPPS_SMT2SIGPPS3_SIZE                        0x1
#define _SMT2SIGPPS_SMT2SIGPPS3_LENGTH                      0x1
#define _SMT2SIGPPS_SMT2SIGPPS3_MASK                        0x8
#define _SMT2SIGPPS_SMT2SIGPPS4_POSN                        0x4
#define _SMT2SIGPPS_SMT2SIGPPS4_POSITION                    0x4
#define _SMT2SIGPPS_SMT2SIGPPS4_SIZE                        0x1
#define _SMT2SIGPPS_SMT2SIGPPS4_LENGTH                      0x1
#define _SMT2SIGPPS_SMT2SIGPPS4_MASK                        0x10
#define _SMT2SIGPPS_SMT2SIGPPS5_POSN                        0x5
#define _SMT2SIGPPS_SMT2SIGPPS5_POSITION                    0x5
#define _SMT2SIGPPS_SMT2SIGPPS5_SIZE                        0x1
#define _SMT2SIGPPS_SMT2SIGPPS5_LENGTH                      0x1
#define _SMT2SIGPPS_SMT2SIGPPS5_MASK                        0x20

// Register: CWG1PPS
#define CWG1PPS CWG1PPS
extern volatile unsigned char           CWG1PPS             __at(0xE0B);
#ifndef _LIB_BUILD
asm("CWG1PPS equ 0E0Bh");
#endif
// aliases
extern volatile unsigned char           CWGINPPS            __at(0xE0B);
#ifndef _LIB_BUILD
asm("CWGINPPS equ 0E0Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CWGINPPS               :6;
    };
    struct {
        unsigned CWGINPPS0              :1;
        unsigned CWGINPPS1              :1;
        unsigned CWGINPPS2              :1;
        unsigned CWGINPPS3              :1;
        unsigned CWGINPPS4              :1;
    };
    struct {
        unsigned CWG1INPPS              :6;
    };
    struct {
        unsigned CWG1INPPS0             :1;
        unsigned CWG1INPPS1             :1;
        unsigned CWG1INPPS2             :1;
        unsigned CWG1INPPS3             :1;
        unsigned CWG1INPPS4             :1;
    };
} CWG1PPSbits_t;
