MikroElektronika/core_packages/PIC/XC8/def/PIC18LF66K40/mcu.h
// Register: IPR6
#define IPR6 IPR6
extern volatile unsigned char           IPR6                __at(0xE25);
#ifndef _LIB_BUILD
asm("IPR6 equ 0E25h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1GIP                :1;
        unsigned TMR3GIP                :1;
        unsigned TMR5GIP                :1;
        unsigned TMR7GIP                :1;
    };
} IPR6bits_t;
extern volatile IPR6bits_t IPR6bits __at(0xE25);
// bitfield macros
#define _IPR6_TMR1GIP_POSN                                  0x0
#define _IPR6_TMR1GIP_POSITION                              0x0
#define _IPR6_TMR1GIP_SIZE                                  0x1
#define _IPR6_TMR1GIP_LENGTH                                0x1
#define _IPR6_TMR1GIP_MASK                                  0x1
#define _IPR6_TMR3GIP_POSN                                  0x1
#define _IPR6_TMR3GIP_POSITION                              0x1
#define _IPR6_TMR3GIP_SIZE                                  0x1
#define _IPR6_TMR3GIP_LENGTH                                0x1
#define _IPR6_TMR3GIP_MASK                                  0x2
#define _IPR6_TMR5GIP_POSN                                  0x2
#define _IPR6_TMR5GIP_POSITION                              0x2
#define _IPR6_TMR5GIP_SIZE                                  0x1
#define _IPR6_TMR5GIP_LENGTH                                0x1
#define _IPR6_TMR5GIP_MASK                                  0x4
#define _IPR6_TMR7GIP_POSN                                  0x3
#define _IPR6_TMR7GIP_POSITION                              0x3
#define _IPR6_TMR7GIP_SIZE                                  0x1
#define _IPR6_TMR7GIP_LENGTH                                0x1
#define _IPR6_TMR7GIP_MASK                                  0x8

// Register: IPR7
#define IPR7 IPR7
extern volatile unsigned char           IPR7                __at(0xE26);
#ifndef _LIB_BUILD
asm("IPR7 equ 0E26h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1IP                 :1;
        unsigned CCP2IP                 :1;
        unsigned CCP3IP                 :1;
        unsigned CCP4IP                 :1;
        unsigned CCP5IP                 :1;
    };
} IPR7bits_t;
extern volatile IPR7bits_t IPR7bits __at(0xE26);
// bitfield macros
#define _IPR7_CCP1IP_POSN                                   0x0
#define _IPR7_CCP1IP_POSITION                               0x0
#define _IPR7_CCP1IP_SIZE                                   0x1
#define _IPR7_CCP1IP_LENGTH                                 0x1
#define _IPR7_CCP1IP_MASK                                   0x1
#define _IPR7_CCP2IP_POSN                                   0x1
#define _IPR7_CCP2IP_POSITION                               0x1
#define _IPR7_CCP2IP_SIZE                                   0x1
#define _IPR7_CCP2IP_LENGTH                                 0x1
#define _IPR7_CCP2IP_MASK                                   0x2
#define _IPR7_CCP3IP_POSN                                   0x2
#define _IPR7_CCP3IP_POSITION                               0x2
#define _IPR7_CCP3IP_SIZE                                   0x1
#define _IPR7_CCP3IP_LENGTH                                 0x1
#define _IPR7_CCP3IP_MASK                                   0x4
#define _IPR7_CCP4IP_POSN                                   0x3
#define _IPR7_CCP4IP_POSITION                               0x3
#define _IPR7_CCP4IP_SIZE                                   0x1
#define _IPR7_CCP4IP_LENGTH                                 0x1
#define _IPR7_CCP4IP_MASK                                   0x8
#define _IPR7_CCP5IP_POSN                                   0x4
#define _IPR7_CCP5IP_POSITION                               0x4
#define _IPR7_CCP5IP_SIZE                                   0x1
#define _IPR7_CCP5IP_LENGTH                                 0x1
#define _IPR7_CCP5IP_MASK                                   0x10

// Register: IPR8
#define IPR8 IPR8
extern volatile unsigned char           IPR8                __at(0xE27);
#ifndef _LIB_BUILD
asm("IPR8 equ 0E27h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWG1IP                 :1;
        unsigned                        :4;
        unsigned NVMIP                  :1;
        unsigned CRCIP                  :1;
        unsigned SCANIP                 :1;
    };
} IPR8bits_t;
extern volatile IPR8bits_t IPR8bits __at(0xE27);
// bitfield macros
#define _IPR8_CWG1IP_POSN                                   0x0
#define _IPR8_CWG1IP_POSITION                               0x0
#define _IPR8_CWG1IP_SIZE                                   0x1
#define _IPR8_CWG1IP_LENGTH                                 0x1
#define _IPR8_CWG1IP_MASK                                   0x1
#define _IPR8_NVMIP_POSN                                    0x5
#define _IPR8_NVMIP_POSITION                                0x5
#define _IPR8_NVMIP_SIZE                                    0x1
#define _IPR8_NVMIP_LENGTH                                  0x1
#define _IPR8_NVMIP_MASK                                    0x20
#define _IPR8_CRCIP_POSN                                    0x6
#define _IPR8_CRCIP_POSITION                                0x6
#define _IPR8_CRCIP_SIZE                                    0x1
#define _IPR8_CRCIP_LENGTH                                  0x1
#define _IPR8_CRCIP_MASK                                    0x40
#define _IPR8_SCANIP_POSN                                   0x7
#define _IPR8_SCANIP_POSITION                               0x7
#define _IPR8_SCANIP_SIZE                                   0x1
#define _IPR8_SCANIP_LENGTH                                 0x1
#define _IPR8_SCANIP_MASK                                   0x80

// Register: IPR9
#define IPR9 IPR9
extern volatile unsigned char           IPR9                __at(0xE28);
#ifndef _LIB_BUILD
asm("IPR9 equ 0E28h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT1IP                 :1;
        unsigned SMT1PRAIP              :1;
        unsigned SMT1PWAIP              :1;
        unsigned SMT2IP                 :1;
        unsigned SMT2PRAIP              :1;
        unsigned SMT2PWAIP              :1;
    };
} IPR9bits_t;
extern volatile IPR9bits_t IPR9bits __at(0xE28);
// bitfield macros
#define _IPR9_SMT1IP_POSN                                   0x0
#define _IPR9_SMT1IP_POSITION                               0x0
#define _IPR9_SMT1IP_SIZE                                   0x1
#define _IPR9_SMT1IP_LENGTH                                 0x1
#define _IPR9_SMT1IP_MASK                                   0x1
#define _IPR9_SMT1PRAIP_POSN                                0x1
#define _IPR9_SMT1PRAIP_POSITION                            0x1
#define _IPR9_SMT1PRAIP_SIZE                                0x1
#define _IPR9_SMT1PRAIP_LENGTH                              0x1
#define _IPR9_SMT1PRAIP_MASK                                0x2
#define _IPR9_SMT1PWAIP_POSN                                0x2
#define _IPR9_SMT1PWAIP_POSITION                            0x2
#define _IPR9_SMT1PWAIP_SIZE                                0x1
#define _IPR9_SMT1PWAIP_LENGTH                              0x1
#define _IPR9_SMT1PWAIP_MASK                                0x4
#define _IPR9_SMT2IP_POSN                                   0x3
#define _IPR9_SMT2IP_POSITION                               0x3
#define _IPR9_SMT2IP_SIZE                                   0x1
#define _IPR9_SMT2IP_LENGTH                                 0x1
#define _IPR9_SMT2IP_MASK                                   0x8
#define _IPR9_SMT2PRAIP_POSN                                0x4
#define _IPR9_SMT2PRAIP_POSITION                            0x4
#define _IPR9_SMT2PRAIP_SIZE                                0x1
#define _IPR9_SMT2PRAIP_LENGTH                              0x1
#define _IPR9_SMT2PRAIP_MASK                                0x10
#define _IPR9_SMT2PWAIP_POSN                                0x5
#define _IPR9_SMT2PWAIP_POSITION                            0x5
#define _IPR9_SMT2PWAIP_SIZE                                0x1
#define _IPR9_SMT2PWAIP_LENGTH                              0x1
#define _IPR9_SMT2PWAIP_MASK                                0x20

// Register: PIE0
#define PIE0 PIE0
extern volatile unsigned char           PIE0                __at(0xE29);
#ifndef _LIB_BUILD
asm("PIE0 equ 0E29h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IE                 :1;
        unsigned INT1IE                 :1;
        unsigned INT2IE                 :1;
        unsigned INT3IE                 :1;
        unsigned IOCIE                  :1;
        unsigned TMR0IE                 :1;
    };
} PIE0bits_t;
extern volatile PIE0bits_t PIE0bits __at(0xE29);
// bitfield macros
#define _PIE0_INT0IE_POSN                                   0x0
#define _PIE0_INT0IE_POSITION                               0x0
#define _PIE0_INT0IE_SIZE                                   0x1
#define _PIE0_INT0IE_LENGTH                                 0x1
#define _PIE0_INT0IE_MASK                                   0x1
#define _PIE0_INT1IE_POSN                                   0x1
#define _PIE0_INT1IE_POSITION                               0x1
#define _PIE0_INT1IE_SIZE                                   0x1
#define _PIE0_INT1IE_LENGTH                                 0x1
#define _PIE0_INT1IE_MASK                                   0x2
#define _PIE0_INT2IE_POSN                                   0x2
#define _PIE0_INT2IE_POSITION                               0x2
#define _PIE0_INT2IE_SIZE                                   0x1
#define _PIE0_INT2IE_LENGTH                                 0x1
#define _PIE0_INT2IE_MASK                                   0x4
#define _PIE0_INT3IE_POSN                                   0x3
#define _PIE0_INT3IE_POSITION                               0x3
#define _PIE0_INT3IE_SIZE                                   0x1
#define _PIE0_INT3IE_LENGTH                                 0x1
#define _PIE0_INT3IE_MASK                                   0x8
#define _PIE0_IOCIE_POSN                                    0x4
#define _PIE0_IOCIE_POSITION                                0x4
#define _PIE0_IOCIE_SIZE                                    0x1
#define _PIE0_IOCIE_LENGTH                                  0x1
#define _PIE0_IOCIE_MASK                                    0x10
#define _PIE0_TMR0IE_POSN                                   0x5
#define _PIE0_TMR0IE_POSITION                               0x5
#define _PIE0_TMR0IE_SIZE                                   0x1
#define _PIE0_TMR0IE_LENGTH                                 0x1
#define _PIE0_TMR0IE_MASK                                   0x20

// Register: PIE1
#define PIE1 PIE1
extern volatile unsigned char           PIE1                __at(0xE2A);
#ifndef _LIB_BUILD
asm("PIE1 equ 0E2Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADIE                   :1;
        unsigned ADTIE                  :1;
        unsigned                        :4;
        unsigned CSWIE                  :1;
        unsigned OSCFIE                 :1;
    };
    struct {
        unsigned                        :7;
        unsigned PSPIE                  :1;
    };
} PIE1bits_t;
extern volatile PIE1bits_t PIE1bits __at(0xE2A);
// bitfield macros
#define _PIE1_ADIE_POSN                                     0x0
#define _PIE1_ADIE_POSITION                                 0x0
#define _PIE1_ADIE_SIZE                                     0x1
#define _PIE1_ADIE_LENGTH                                   0x1
#define _PIE1_ADIE_MASK                                     0x1
#define _PIE1_ADTIE_POSN                                    0x1
#define _PIE1_ADTIE_POSITION                                0x1
#define _PIE1_ADTIE_SIZE                                    0x1
#define _PIE1_ADTIE_LENGTH                                  0x1
#define _PIE1_ADTIE_MASK                                    0x2
#define _PIE1_CSWIE_POSN                                    0x6
#define _PIE1_CSWIE_POSITION                                0x6
#define _PIE1_CSWIE_SIZE                                    0x1
#define _PIE1_CSWIE_LENGTH                                  0x1
#define _PIE1_CSWIE_MASK                                    0x40
#define _PIE1_OSCFIE_POSN                                   0x7
#define _PIE1_OSCFIE_POSITION                               0x7
#define _PIE1_OSCFIE_SIZE                                   0x1
#define _PIE1_OSCFIE_LENGTH                                 0x1
#define _PIE1_OSCFIE_MASK                                   0x80
#define _PIE1_PSPIE_POSN                                    0x7
#define _PIE1_PSPIE_POSITION                                0x7
#define _PIE1_PSPIE_SIZE                                    0x1
#define _PIE1_PSPIE_LENGTH                                  0x1
#define _PIE1_PSPIE_MASK                                    0x80

// Register: PIE2
#define PIE2 PIE2
extern volatile unsigned char           PIE2                __at(0xE2B);
#ifndef _LIB_BUILD
asm("PIE2 equ 0E2Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1IE                   :1;
        unsigned C2IE                   :1;
        unsigned C3IE                   :1;
        unsigned                        :3;
        unsigned ZCDIE                  :1;
        unsigned HLVDIE                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned CMIE                   :1;
    };
} PIE2bits_t;
extern volatile PIE2bits_t PIE2bits __at(0xE2B);
// bitfield macros
#define _PIE2_C1IE_POSN                                     0x0
#define _PIE2_C1IE_POSITION                                 0x0
#define _PIE2_C1IE_SIZE                                     0x1
#define _PIE2_C1IE_LENGTH                                   0x1
#define _PIE2_C1IE_MASK                                     0x1
#define _PIE2_C2IE_POSN                                     0x1
#define _PIE2_C2IE_POSITION                                 0x1
#define _PIE2_C2IE_SIZE                                     0x1
#define _PIE2_C2IE_LENGTH                                   0x1
#define _PIE2_C2IE_MASK                                     0x2
#define _PIE2_C3IE_POSN                                     0x2
#define _PIE2_C3IE_POSITION                                 0x2
#define _PIE2_C3IE_SIZE                                     0x1
#define _PIE2_C3IE_LENGTH                                   0x1
#define _PIE2_C3IE_MASK                                     0x4
#define _PIE2_ZCDIE_POSN                                    0x6
#define _PIE2_ZCDIE_POSITION                                0x6
#define _PIE2_ZCDIE_SIZE                                    0x1
#define _PIE2_ZCDIE_LENGTH                                  0x1
#define _PIE2_ZCDIE_MASK                                    0x40
#define _PIE2_HLVDIE_POSN                                   0x7
#define _PIE2_HLVDIE_POSITION                               0x7
#define _PIE2_HLVDIE_SIZE                                   0x1
#define _PIE2_HLVDIE_LENGTH                                 0x1
#define _PIE2_HLVDIE_MASK                                   0x80
#define _PIE2_CMIE_POSN                                     0x6
#define _PIE2_CMIE_POSITION                                 0x6
#define _PIE2_CMIE_SIZE                                     0x1
#define _PIE2_CMIE_LENGTH                                   0x1
#define _PIE2_CMIE_MASK                                     0x40

// Register: PIE3
#define PIE3 PIE3
extern volatile unsigned char           PIE3                __at(0xE2C);
#ifndef _LIB_BUILD
asm("PIE3 equ 0E2Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1IE                 :1;
        unsigned BCL1IE                 :1;
        unsigned SSP2IE                 :1;
        unsigned BCL2IE                 :1;
        unsigned TX1IE                  :1;
        unsigned RC1IE                  :1;
        unsigned TX2IE                  :1;
        unsigned RC2IE                  :1;
    };
    struct {
        unsigned RXB0IE                 :1;
        unsigned RXB1IE                 :1;
        unsigned TXB0IE                 :1;
        unsigned TXB1IE                 :1;
        unsigned TXB2IE                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned RXBNIE                 :1;
        unsigned                        :2;
        unsigned TXBNIE                 :1;
    };
} PIE3bits_t;
extern volatile PIE3bits_t PIE3bits __at(0xE2C);
// bitfield macros
#define _PIE3_SSP1IE_POSN                                   0x0
#define _PIE3_SSP1IE_POSITION                               0x0
#define _PIE3_SSP1IE_SIZE                                   0x1
#define _PIE3_SSP1IE_LENGTH                                 0x1
#define _PIE3_SSP1IE_MASK                                   0x1
#define _PIE3_BCL1IE_POSN                                   0x1
#define _PIE3_BCL1IE_POSITION                               0x1
#define _PIE3_BCL1IE_SIZE                                   0x1
#define _PIE3_BCL1IE_LENGTH                                 0x1
#define _PIE3_BCL1IE_MASK                                   0x2
#define _PIE3_SSP2IE_POSN                                   0x2
#define _PIE3_SSP2IE_POSITION                               0x2
#define _PIE3_SSP2IE_SIZE                                   0x1
#define _PIE3_SSP2IE_LENGTH                                 0x1
#define _PIE3_SSP2IE_MASK                                   0x4
#define _PIE3_BCL2IE_POSN                                   0x3
#define _PIE3_BCL2IE_POSITION                               0x3
#define _PIE3_BCL2IE_SIZE                                   0x1
#define _PIE3_BCL2IE_LENGTH                                 0x1
#define _PIE3_BCL2IE_MASK                                   0x8
#define _PIE3_TX1IE_POSN                                    0x4
#define _PIE3_TX1IE_POSITION                                0x4
#define _PIE3_TX1IE_SIZE                                    0x1
#define _PIE3_TX1IE_LENGTH                                  0x1
#define _PIE3_TX1IE_MASK                                    0x10
#define _PIE3_RC1IE_POSN                                    0x5
#define _PIE3_RC1IE_POSITION                                0x5
#define _PIE3_RC1IE_SIZE                                    0x1
#define _PIE3_RC1IE_LENGTH                                  0x1
#define _PIE3_RC1IE_MASK                                    0x20
#define _PIE3_TX2IE_POSN                                    0x6
#define _PIE3_TX2IE_POSITION                                0x6
#define _PIE3_TX2IE_SIZE                                    0x1
#define _PIE3_TX2IE_LENGTH                                  0x1
#define _PIE3_TX2IE_MASK                                    0x40
#define _PIE3_RC2IE_POSN                                    0x7
#define _PIE3_RC2IE_POSITION                                0x7
#define _PIE3_RC2IE_SIZE                                    0x1
#define _PIE3_RC2IE_LENGTH                                  0x1
#define _PIE3_RC2IE_MASK                                    0x80
#define _PIE3_RXB0IE_POSN                                   0x0
#define _PIE3_RXB0IE_POSITION                               0x0
#define _PIE3_RXB0IE_SIZE                                   0x1
#define _PIE3_RXB0IE_LENGTH                                 0x1
#define _PIE3_RXB0IE_MASK                                   0x1
#define _PIE3_RXB1IE_POSN                                   0x1
#define _PIE3_RXB1IE_POSITION                               0x1
#define _PIE3_RXB1IE_SIZE                                   0x1
#define _PIE3_RXB1IE_LENGTH                                 0x1
#define _PIE3_RXB1IE_MASK                                   0x2
#define _PIE3_TXB0IE_POSN                                   0x2
#define _PIE3_TXB0IE_POSITION                               0x2
#define _PIE3_TXB0IE_SIZE                                   0x1
#define _PIE3_TXB0IE_LENGTH                                 0x1
#define _PIE3_TXB0IE_MASK                                   0x4
#define _PIE3_TXB1IE_POSN                                   0x3
#define _PIE3_TXB1IE_POSITION                               0x3
#define _PIE3_TXB1IE_SIZE                                   0x1
#define _PIE3_TXB1IE_LENGTH                                 0x1
#define _PIE3_TXB1IE_MASK                                   0x8
#define _PIE3_TXB2IE_POSN                                   0x4
#define _PIE3_TXB2IE_POSITION                               0x4
#define _PIE3_TXB2IE_SIZE                                   0x1
#define _PIE3_TXB2IE_LENGTH                                 0x1
#define _PIE3_TXB2IE_MASK                                   0x10
#define _PIE3_RXBNIE_POSN                                   0x1
#define _PIE3_RXBNIE_POSITION                               0x1
#define _PIE3_RXBNIE_SIZE                                   0x1
#define _PIE3_RXBNIE_LENGTH                                 0x1
#define _PIE3_RXBNIE_MASK                                   0x2
#define _PIE3_TXBNIE_POSN                                   0x4
#define _PIE3_TXBNIE_POSITION                               0x4
#define _PIE3_TXBNIE_SIZE                                   0x1
#define _PIE3_TXBNIE_LENGTH                                 0x1
#define _PIE3_TXBNIE_MASK                                   0x10

