MikroElektronika/core_packages/PIC/XC8/def/PIC18LF66K40/mcu.h
extern volatile BAUD2CONbits_t BAUD2CONbits __at(0xEF7);
// bitfield macros
#define _BAUD2CON_ABDEN_POSN                                0x0
#define _BAUD2CON_ABDEN_POSITION                            0x0
#define _BAUD2CON_ABDEN_SIZE                                0x1
#define _BAUD2CON_ABDEN_LENGTH                              0x1
#define _BAUD2CON_ABDEN_MASK                                0x1
#define _BAUD2CON_WUE_POSN                                  0x1
#define _BAUD2CON_WUE_POSITION                              0x1
#define _BAUD2CON_WUE_SIZE                                  0x1
#define _BAUD2CON_WUE_LENGTH                                0x1
#define _BAUD2CON_WUE_MASK                                  0x2
#define _BAUD2CON_BRG16_POSN                                0x3
#define _BAUD2CON_BRG16_POSITION                            0x3
#define _BAUD2CON_BRG16_SIZE                                0x1
#define _BAUD2CON_BRG16_LENGTH                              0x1
#define _BAUD2CON_BRG16_MASK                                0x8
#define _BAUD2CON_SCKP_POSN                                 0x4
#define _BAUD2CON_SCKP_POSITION                             0x4
#define _BAUD2CON_SCKP_SIZE                                 0x1
#define _BAUD2CON_SCKP_LENGTH                               0x1
#define _BAUD2CON_SCKP_MASK                                 0x10
#define _BAUD2CON_RCIDL_POSN                                0x6
#define _BAUD2CON_RCIDL_POSITION                            0x6
#define _BAUD2CON_RCIDL_SIZE                                0x1
#define _BAUD2CON_RCIDL_LENGTH                              0x1
#define _BAUD2CON_RCIDL_MASK                                0x40
#define _BAUD2CON_ABDOVF_POSN                               0x7
#define _BAUD2CON_ABDOVF_POSITION                           0x7
#define _BAUD2CON_ABDOVF_SIZE                               0x1
#define _BAUD2CON_ABDOVF_LENGTH                             0x1
#define _BAUD2CON_ABDOVF_MASK                               0x80
#define _BAUD2CON_ABDEN2_POSN                               0x0
#define _BAUD2CON_ABDEN2_POSITION                           0x0
#define _BAUD2CON_ABDEN2_SIZE                               0x1
#define _BAUD2CON_ABDEN2_LENGTH                             0x1
#define _BAUD2CON_ABDEN2_MASK                               0x1
#define _BAUD2CON_ABDOVF2_POSN                              0x7
#define _BAUD2CON_ABDOVF2_POSITION                          0x7
#define _BAUD2CON_ABDOVF2_SIZE                              0x1
#define _BAUD2CON_ABDOVF2_LENGTH                            0x1
#define _BAUD2CON_ABDOVF2_MASK                              0x80
#define _BAUD2CON_BRG162_POSN                               0x3
#define _BAUD2CON_BRG162_POSITION                           0x3
#define _BAUD2CON_BRG162_SIZE                               0x1
#define _BAUD2CON_BRG162_LENGTH                             0x1
#define _BAUD2CON_BRG162_MASK                               0x8
#define _BAUD2CON_RCIDL2_POSN                               0x6
#define _BAUD2CON_RCIDL2_POSITION                           0x6
#define _BAUD2CON_RCIDL2_SIZE                               0x1
#define _BAUD2CON_RCIDL2_LENGTH                             0x1
#define _BAUD2CON_RCIDL2_MASK                               0x40
#define _BAUD2CON_RCMT2_POSN                                0x6
#define _BAUD2CON_RCMT2_POSITION                            0x6
#define _BAUD2CON_RCMT2_SIZE                                0x1
#define _BAUD2CON_RCMT2_LENGTH                              0x1
#define _BAUD2CON_RCMT2_MASK                                0x40
#define _BAUD2CON_SCKP2_POSN                                0x4
#define _BAUD2CON_SCKP2_POSITION                            0x4
#define _BAUD2CON_SCKP2_SIZE                                0x1
#define _BAUD2CON_SCKP2_LENGTH                              0x1
#define _BAUD2CON_SCKP2_MASK                                0x10
#define _BAUD2CON_TXCKP2_POSN                               0x4
#define _BAUD2CON_TXCKP2_POSITION                           0x4
#define _BAUD2CON_TXCKP2_SIZE                               0x1
#define _BAUD2CON_TXCKP2_LENGTH                             0x1
#define _BAUD2CON_TXCKP2_MASK                               0x10
#define _BAUD2CON_WUE2_POSN                                 0x1
#define _BAUD2CON_WUE2_POSITION                             0x1
#define _BAUD2CON_WUE2_SIZE                                 0x1
#define _BAUD2CON_WUE2_LENGTH                               0x1
#define _BAUD2CON_WUE2_MASK                                 0x2
// alias bitfield definitions
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned                        :1;
        unsigned BRG16                  :1;
        unsigned SCKP                   :1;
        unsigned                        :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
    struct {
        unsigned ABDEN2                 :1;
    };
    struct {
        unsigned                        :7;
        unsigned ABDOVF2                :1;
    };
    struct {
        unsigned                        :3;
        unsigned BRG162                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned RCIDL2                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned RCMT2                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned SCKP2                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned TXCKP2                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned WUE2                   :1;
    };
} BAUDCON2bits_t;
extern volatile BAUDCON2bits_t BAUDCON2bits __at(0xEF7);
// bitfield macros
#define _BAUDCON2_ABDEN_POSN                                0x0
#define _BAUDCON2_ABDEN_POSITION                            0x0
#define _BAUDCON2_ABDEN_SIZE                                0x1
#define _BAUDCON2_ABDEN_LENGTH                              0x1
#define _BAUDCON2_ABDEN_MASK                                0x1
#define _BAUDCON2_WUE_POSN                                  0x1
#define _BAUDCON2_WUE_POSITION                              0x1
#define _BAUDCON2_WUE_SIZE                                  0x1
#define _BAUDCON2_WUE_LENGTH                                0x1
#define _BAUDCON2_WUE_MASK                                  0x2
#define _BAUDCON2_BRG16_POSN                                0x3
#define _BAUDCON2_BRG16_POSITION                            0x3
#define _BAUDCON2_BRG16_SIZE                                0x1
#define _BAUDCON2_BRG16_LENGTH                              0x1
#define _BAUDCON2_BRG16_MASK                                0x8
#define _BAUDCON2_SCKP_POSN                                 0x4
#define _BAUDCON2_SCKP_POSITION                             0x4
#define _BAUDCON2_SCKP_SIZE                                 0x1
#define _BAUDCON2_SCKP_LENGTH                               0x1
#define _BAUDCON2_SCKP_MASK                                 0x10
#define _BAUDCON2_RCIDL_POSN                                0x6
#define _BAUDCON2_RCIDL_POSITION                            0x6
#define _BAUDCON2_RCIDL_SIZE                                0x1
#define _BAUDCON2_RCIDL_LENGTH                              0x1
#define _BAUDCON2_RCIDL_MASK                                0x40
#define _BAUDCON2_ABDOVF_POSN                               0x7
#define _BAUDCON2_ABDOVF_POSITION                           0x7
#define _BAUDCON2_ABDOVF_SIZE                               0x1
#define _BAUDCON2_ABDOVF_LENGTH                             0x1
#define _BAUDCON2_ABDOVF_MASK                               0x80
#define _BAUDCON2_ABDEN2_POSN                               0x0
#define _BAUDCON2_ABDEN2_POSITION                           0x0
#define _BAUDCON2_ABDEN2_SIZE                               0x1
#define _BAUDCON2_ABDEN2_LENGTH                             0x1
#define _BAUDCON2_ABDEN2_MASK                               0x1
#define _BAUDCON2_ABDOVF2_POSN                              0x7
#define _BAUDCON2_ABDOVF2_POSITION                          0x7
#define _BAUDCON2_ABDOVF2_SIZE                              0x1
#define _BAUDCON2_ABDOVF2_LENGTH                            0x1
#define _BAUDCON2_ABDOVF2_MASK                              0x80
#define _BAUDCON2_BRG162_POSN                               0x3
#define _BAUDCON2_BRG162_POSITION                           0x3
#define _BAUDCON2_BRG162_SIZE                               0x1
#define _BAUDCON2_BRG162_LENGTH                             0x1
#define _BAUDCON2_BRG162_MASK                               0x8
#define _BAUDCON2_RCIDL2_POSN                               0x6
#define _BAUDCON2_RCIDL2_POSITION                           0x6
#define _BAUDCON2_RCIDL2_SIZE                               0x1
#define _BAUDCON2_RCIDL2_LENGTH                             0x1
#define _BAUDCON2_RCIDL2_MASK                               0x40
#define _BAUDCON2_RCMT2_POSN                                0x6
#define _BAUDCON2_RCMT2_POSITION                            0x6
#define _BAUDCON2_RCMT2_SIZE                                0x1
#define _BAUDCON2_RCMT2_LENGTH                              0x1
#define _BAUDCON2_RCMT2_MASK                                0x40
#define _BAUDCON2_SCKP2_POSN                                0x4
#define _BAUDCON2_SCKP2_POSITION                            0x4
#define _BAUDCON2_SCKP2_SIZE                                0x1
#define _BAUDCON2_SCKP2_LENGTH                              0x1
#define _BAUDCON2_SCKP2_MASK                                0x10
#define _BAUDCON2_TXCKP2_POSN                               0x4
#define _BAUDCON2_TXCKP2_POSITION                           0x4
#define _BAUDCON2_TXCKP2_SIZE                               0x1
#define _BAUDCON2_TXCKP2_LENGTH                             0x1
#define _BAUDCON2_TXCKP2_MASK                               0x10
#define _BAUDCON2_WUE2_POSN                                 0x1
#define _BAUDCON2_WUE2_POSITION                             0x1
#define _BAUDCON2_WUE2_SIZE                                 0x1
#define _BAUDCON2_WUE2_LENGTH                               0x1
#define _BAUDCON2_WUE2_MASK                                 0x2
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned                        :1;
        unsigned BRG16                  :1;
        unsigned SCKP                   :1;
        unsigned                        :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
    struct {
        unsigned ABDEN2                 :1;
    };
    struct {
        unsigned                        :7;
        unsigned ABDOVF2                :1;
    };
    struct {
        unsigned                        :3;
        unsigned BRG162                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned RCIDL2                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned RCMT2                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned SCKP2                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned TXCKP2                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned WUE2                   :1;
    };
} BAUDCTL2bits_t;
extern volatile BAUDCTL2bits_t BAUDCTL2bits __at(0xEF7);
// bitfield macros
#define _BAUDCTL2_ABDEN_POSN                                0x0
#define _BAUDCTL2_ABDEN_POSITION                            0x0
#define _BAUDCTL2_ABDEN_SIZE                                0x1
#define _BAUDCTL2_ABDEN_LENGTH                              0x1
#define _BAUDCTL2_ABDEN_MASK                                0x1
#define _BAUDCTL2_WUE_POSN                                  0x1
#define _BAUDCTL2_WUE_POSITION                              0x1
#define _BAUDCTL2_WUE_SIZE                                  0x1
#define _BAUDCTL2_WUE_LENGTH                                0x1
#define _BAUDCTL2_WUE_MASK                                  0x2
#define _BAUDCTL2_BRG16_POSN                                0x3
#define _BAUDCTL2_BRG16_POSITION                            0x3
#define _BAUDCTL2_BRG16_SIZE                                0x1
#define _BAUDCTL2_BRG16_LENGTH                              0x1
#define _BAUDCTL2_BRG16_MASK                                0x8
#define _BAUDCTL2_SCKP_POSN                                 0x4
#define _BAUDCTL2_SCKP_POSITION                             0x4
#define _BAUDCTL2_SCKP_SIZE                                 0x1
#define _BAUDCTL2_SCKP_LENGTH                               0x1
#define _BAUDCTL2_SCKP_MASK                                 0x10
#define _BAUDCTL2_RCIDL_POSN                                0x6
#define _BAUDCTL2_RCIDL_POSITION                            0x6
#define _BAUDCTL2_RCIDL_SIZE                                0x1
#define _BAUDCTL2_RCIDL_LENGTH                              0x1
#define _BAUDCTL2_RCIDL_MASK                                0x40
#define _BAUDCTL2_ABDOVF_POSN                               0x7
#define _BAUDCTL2_ABDOVF_POSITION                           0x7
#define _BAUDCTL2_ABDOVF_SIZE                               0x1
#define _BAUDCTL2_ABDOVF_LENGTH                             0x1
#define _BAUDCTL2_ABDOVF_MASK                               0x80
#define _BAUDCTL2_ABDEN2_POSN                               0x0
#define _BAUDCTL2_ABDEN2_POSITION                           0x0
#define _BAUDCTL2_ABDEN2_SIZE                               0x1
#define _BAUDCTL2_ABDEN2_LENGTH                             0x1
#define _BAUDCTL2_ABDEN2_MASK                               0x1
#define _BAUDCTL2_ABDOVF2_POSN                              0x7
#define _BAUDCTL2_ABDOVF2_POSITION                          0x7
#define _BAUDCTL2_ABDOVF2_SIZE                              0x1
#define _BAUDCTL2_ABDOVF2_LENGTH                            0x1
#define _BAUDCTL2_ABDOVF2_MASK                              0x80
#define _BAUDCTL2_BRG162_POSN                               0x3
#define _BAUDCTL2_BRG162_POSITION                           0x3
#define _BAUDCTL2_BRG162_SIZE                               0x1
#define _BAUDCTL2_BRG162_LENGTH                             0x1
#define _BAUDCTL2_BRG162_MASK                               0x8
#define _BAUDCTL2_RCIDL2_POSN                               0x6
#define _BAUDCTL2_RCIDL2_POSITION                           0x6
#define _BAUDCTL2_RCIDL2_SIZE                               0x1
#define _BAUDCTL2_RCIDL2_LENGTH                             0x1
#define _BAUDCTL2_RCIDL2_MASK                               0x40
#define _BAUDCTL2_RCMT2_POSN                                0x6
#define _BAUDCTL2_RCMT2_POSITION                            0x6
#define _BAUDCTL2_RCMT2_SIZE                                0x1
#define _BAUDCTL2_RCMT2_LENGTH                              0x1
#define _BAUDCTL2_RCMT2_MASK                                0x40
#define _BAUDCTL2_SCKP2_POSN                                0x4
#define _BAUDCTL2_SCKP2_POSITION                            0x4
#define _BAUDCTL2_SCKP2_SIZE                                0x1
#define _BAUDCTL2_SCKP2_LENGTH                              0x1
#define _BAUDCTL2_SCKP2_MASK                                0x10
#define _BAUDCTL2_TXCKP2_POSN                               0x4
#define _BAUDCTL2_TXCKP2_POSITION                           0x4
#define _BAUDCTL2_TXCKP2_SIZE                               0x1
#define _BAUDCTL2_TXCKP2_LENGTH                             0x1
#define _BAUDCTL2_TXCKP2_MASK                               0x10
#define _BAUDCTL2_WUE2_POSN                                 0x1
#define _BAUDCTL2_WUE2_POSITION                             0x1
#define _BAUDCTL2_WUE2_SIZE                                 0x1
#define _BAUDCTL2_WUE2_LENGTH                               0x1
#define _BAUDCTL2_WUE2_MASK                                 0x2

// Register: SMT2TMR
#define SMT2TMR SMT2TMR
#ifndef __CCI__
extern volatile __uint24                SMT2TMR             __at(0xEF8);
#endif
#ifndef _LIB_BUILD
asm("SMT2TMR equ 0EF8h");
#endif

