MikroElektronika/core_packages/PIC/XC8/def/PIC18LF66K40/mcu.h
// Register: CCP4CAP
#define CCP4CAP CCP4CAP
extern volatile unsigned char           CCP4CAP             __at(0xF23);
#ifndef _LIB_BUILD
asm("CCP4CAP equ 0F23h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTS                    :8;
    };
    struct {
        unsigned CTS0                   :1;
        unsigned CTS1                   :1;
        unsigned CTS2                   :1;
        unsigned CTS3                   :1;
        unsigned CTS4                   :1;
        unsigned CTS5                   :1;
        unsigned CTS6                   :1;
        unsigned CTS7                   :1;
    };
    struct {
        unsigned CCP4CTS                :8;
    };
    struct {
        unsigned CCP4CTS0               :1;
        unsigned CCP4CTS1               :1;
        unsigned CCP4CTS2               :1;
        unsigned CCP4CTS3               :1;
        unsigned CCP4CTS4               :1;
        unsigned CCP4CTS5               :1;
        unsigned CCP4CTS6               :1;
        unsigned CCP4CTS7               :1;
    };
} CCP4CAPbits_t;
extern volatile CCP4CAPbits_t CCP4CAPbits __at(0xF23);
// bitfield macros
#define _CCP4CAP_CTS_POSN                                   0x0
#define _CCP4CAP_CTS_POSITION                               0x0
#define _CCP4CAP_CTS_SIZE                                   0x8
#define _CCP4CAP_CTS_LENGTH                                 0x8
#define _CCP4CAP_CTS_MASK                                   0xFF
#define _CCP4CAP_CTS0_POSN                                  0x0
#define _CCP4CAP_CTS0_POSITION                              0x0
#define _CCP4CAP_CTS0_SIZE                                  0x1
#define _CCP4CAP_CTS0_LENGTH                                0x1
#define _CCP4CAP_CTS0_MASK                                  0x1
#define _CCP4CAP_CTS1_POSN                                  0x1
#define _CCP4CAP_CTS1_POSITION                              0x1
#define _CCP4CAP_CTS1_SIZE                                  0x1
#define _CCP4CAP_CTS1_LENGTH                                0x1
#define _CCP4CAP_CTS1_MASK                                  0x2
#define _CCP4CAP_CTS2_POSN                                  0x2
#define _CCP4CAP_CTS2_POSITION                              0x2
#define _CCP4CAP_CTS2_SIZE                                  0x1
#define _CCP4CAP_CTS2_LENGTH                                0x1
#define _CCP4CAP_CTS2_MASK                                  0x4
#define _CCP4CAP_CTS3_POSN                                  0x3
#define _CCP4CAP_CTS3_POSITION                              0x3
#define _CCP4CAP_CTS3_SIZE                                  0x1
#define _CCP4CAP_CTS3_LENGTH                                0x1
#define _CCP4CAP_CTS3_MASK                                  0x8
#define _CCP4CAP_CTS4_POSN                                  0x4
#define _CCP4CAP_CTS4_POSITION                              0x4
#define _CCP4CAP_CTS4_SIZE                                  0x1
#define _CCP4CAP_CTS4_LENGTH                                0x1
#define _CCP4CAP_CTS4_MASK                                  0x10
#define _CCP4CAP_CTS5_POSN                                  0x5
#define _CCP4CAP_CTS5_POSITION                              0x5
#define _CCP4CAP_CTS5_SIZE                                  0x1
#define _CCP4CAP_CTS5_LENGTH                                0x1
#define _CCP4CAP_CTS5_MASK                                  0x20
#define _CCP4CAP_CTS6_POSN                                  0x6
#define _CCP4CAP_CTS6_POSITION                              0x6
#define _CCP4CAP_CTS6_SIZE                                  0x1
#define _CCP4CAP_CTS6_LENGTH                                0x1
#define _CCP4CAP_CTS6_MASK                                  0x40
#define _CCP4CAP_CTS7_POSN                                  0x7
#define _CCP4CAP_CTS7_POSITION                              0x7
#define _CCP4CAP_CTS7_SIZE                                  0x1
#define _CCP4CAP_CTS7_LENGTH                                0x1
#define _CCP4CAP_CTS7_MASK                                  0x80
#define _CCP4CAP_CCP4CTS_POSN                               0x0
#define _CCP4CAP_CCP4CTS_POSITION                           0x0
#define _CCP4CAP_CCP4CTS_SIZE                               0x8
#define _CCP4CAP_CCP4CTS_LENGTH                             0x8
#define _CCP4CAP_CCP4CTS_MASK                               0xFF
#define _CCP4CAP_CCP4CTS0_POSN                              0x0
#define _CCP4CAP_CCP4CTS0_POSITION                          0x0
#define _CCP4CAP_CCP4CTS0_SIZE                              0x1
#define _CCP4CAP_CCP4CTS0_LENGTH                            0x1
#define _CCP4CAP_CCP4CTS0_MASK                              0x1
#define _CCP4CAP_CCP4CTS1_POSN                              0x1
#define _CCP4CAP_CCP4CTS1_POSITION                          0x1
#define _CCP4CAP_CCP4CTS1_SIZE                              0x1
#define _CCP4CAP_CCP4CTS1_LENGTH                            0x1
#define _CCP4CAP_CCP4CTS1_MASK                              0x2
#define _CCP4CAP_CCP4CTS2_POSN                              0x2
#define _CCP4CAP_CCP4CTS2_POSITION                          0x2
#define _CCP4CAP_CCP4CTS2_SIZE                              0x1
#define _CCP4CAP_CCP4CTS2_LENGTH                            0x1
#define _CCP4CAP_CCP4CTS2_MASK                              0x4
#define _CCP4CAP_CCP4CTS3_POSN                              0x3
#define _CCP4CAP_CCP4CTS3_POSITION                          0x3
#define _CCP4CAP_CCP4CTS3_SIZE                              0x1
#define _CCP4CAP_CCP4CTS3_LENGTH                            0x1
#define _CCP4CAP_CCP4CTS3_MASK                              0x8
#define _CCP4CAP_CCP4CTS4_POSN                              0x4
#define _CCP4CAP_CCP4CTS4_POSITION                          0x4
#define _CCP4CAP_CCP4CTS4_SIZE                              0x1
#define _CCP4CAP_CCP4CTS4_LENGTH                            0x1
#define _CCP4CAP_CCP4CTS4_MASK                              0x10
#define _CCP4CAP_CCP4CTS5_POSN                              0x5
#define _CCP4CAP_CCP4CTS5_POSITION                          0x5
#define _CCP4CAP_CCP4CTS5_SIZE                              0x1
#define _CCP4CAP_CCP4CTS5_LENGTH                            0x1
#define _CCP4CAP_CCP4CTS5_MASK                              0x20
#define _CCP4CAP_CCP4CTS6_POSN                              0x6
#define _CCP4CAP_CCP4CTS6_POSITION                          0x6
#define _CCP4CAP_CCP4CTS6_SIZE                              0x1
#define _CCP4CAP_CCP4CTS6_LENGTH                            0x1
#define _CCP4CAP_CCP4CTS6_MASK                              0x40
#define _CCP4CAP_CCP4CTS7_POSN                              0x7
#define _CCP4CAP_CCP4CTS7_POSITION                          0x7
#define _CCP4CAP_CCP4CTS7_SIZE                              0x1
#define _CCP4CAP_CCP4CTS7_LENGTH                            0x1
#define _CCP4CAP_CCP4CTS7_MASK                              0x80

// Register: CCPR3
#define CCPR3 CCPR3
extern volatile unsigned short          CCPR3               __at(0xF24);
#ifndef _LIB_BUILD
asm("CCPR3 equ 0F24h");
#endif

