MikroElektronika/core_packages/PIC/XC8/def/PIC18LF66K40/mcu.h
extern volatile T7GCONbits_t T7GCONbits __at(0xF31);
// bitfield macros
#define _T7GCON_GGO_NOT_DONE_POSN                           0x3
#define _T7GCON_GGO_NOT_DONE_POSITION                       0x3
#define _T7GCON_GGO_NOT_DONE_SIZE                           0x1
#define _T7GCON_GGO_NOT_DONE_LENGTH                         0x1
#define _T7GCON_GGO_NOT_DONE_MASK                           0x8
#define _T7GCON_GVAL_POSN                                   0x2
#define _T7GCON_GVAL_POSITION                               0x2
#define _T7GCON_GVAL_SIZE                                   0x1
#define _T7GCON_GVAL_LENGTH                                 0x1
#define _T7GCON_GVAL_MASK                                   0x4
#define _T7GCON_GGO_nDONE_POSN                              0x3
#define _T7GCON_GGO_nDONE_POSITION                          0x3
#define _T7GCON_GGO_nDONE_SIZE                              0x1
#define _T7GCON_GGO_nDONE_LENGTH                            0x1
#define _T7GCON_GGO_nDONE_MASK                              0x8
#define _T7GCON_GSPM_POSN                                   0x4
#define _T7GCON_GSPM_POSITION                               0x4
#define _T7GCON_GSPM_SIZE                                   0x1
#define _T7GCON_GSPM_LENGTH                                 0x1
#define _T7GCON_GSPM_MASK                                   0x10
#define _T7GCON_GTM_POSN                                    0x5
#define _T7GCON_GTM_POSITION                                0x5
#define _T7GCON_GTM_SIZE                                    0x1
#define _T7GCON_GTM_LENGTH                                  0x1
#define _T7GCON_GTM_MASK                                    0x20
#define _T7GCON_GPOL_POSN                                   0x6
#define _T7GCON_GPOL_POSITION                               0x6
#define _T7GCON_GPOL_SIZE                                   0x1
#define _T7GCON_GPOL_LENGTH                                 0x1
#define _T7GCON_GPOL_MASK                                   0x40
#define _T7GCON_GE_POSN                                     0x7
#define _T7GCON_GE_POSITION                                 0x7
#define _T7GCON_GE_SIZE                                     0x1
#define _T7GCON_GE_LENGTH                                   0x1
#define _T7GCON_GE_MASK                                     0x80
#define _T7GCON_T7GGO_NOT_DONE_POSN                         0x3
#define _T7GCON_T7GGO_NOT_DONE_POSITION                     0x3
#define _T7GCON_T7GGO_NOT_DONE_SIZE                         0x1
#define _T7GCON_T7GGO_NOT_DONE_LENGTH                       0x1
#define _T7GCON_T7GGO_NOT_DONE_MASK                         0x8
#define _T7GCON_T7GVAL_POSN                                 0x2
#define _T7GCON_T7GVAL_POSITION                             0x2
#define _T7GCON_T7GVAL_SIZE                                 0x1
#define _T7GCON_T7GVAL_LENGTH                               0x1
#define _T7GCON_T7GVAL_MASK                                 0x4
#define _T7GCON_T7GGO_nDONE_POSN                            0x3
#define _T7GCON_T7GGO_nDONE_POSITION                        0x3
#define _T7GCON_T7GGO_nDONE_SIZE                            0x1
#define _T7GCON_T7GGO_nDONE_LENGTH                          0x1
#define _T7GCON_T7GGO_nDONE_MASK                            0x8
#define _T7GCON_T7GSPM_POSN                                 0x4
#define _T7GCON_T7GSPM_POSITION                             0x4
#define _T7GCON_T7GSPM_SIZE                                 0x1
#define _T7GCON_T7GSPM_LENGTH                               0x1
#define _T7GCON_T7GSPM_MASK                                 0x10
#define _T7GCON_T7GTM_POSN                                  0x5
#define _T7GCON_T7GTM_POSITION                              0x5
#define _T7GCON_T7GTM_SIZE                                  0x1
#define _T7GCON_T7GTM_LENGTH                                0x1
#define _T7GCON_T7GTM_MASK                                  0x20
#define _T7GCON_T7GPOL_POSN                                 0x6
#define _T7GCON_T7GPOL_POSITION                             0x6
#define _T7GCON_T7GPOL_SIZE                                 0x1
#define _T7GCON_T7GPOL_LENGTH                               0x1
#define _T7GCON_T7GPOL_MASK                                 0x40
#define _T7GCON_T7GE_POSN                                   0x7
#define _T7GCON_T7GE_POSITION                               0x7
#define _T7GCON_T7GE_SIZE                                   0x1
#define _T7GCON_T7GE_LENGTH                                 0x1
#define _T7GCON_T7GE_MASK                                   0x80
#define _T7GCON_T7GGO_POSN                                  0x3
#define _T7GCON_T7GGO_POSITION                              0x3
#define _T7GCON_T7GGO_SIZE                                  0x1
#define _T7GCON_T7GGO_LENGTH                                0x1
#define _T7GCON_T7GGO_MASK                                  0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned GGO_NOT_DONE           :1;
    };
    struct {
        unsigned                        :2;
        unsigned GVAL                   :1;
        unsigned GGO_nDONE              :1;
        unsigned GSPM                   :1;
        unsigned GTM                    :1;
        unsigned GPOL                   :1;
        unsigned GE                     :1;
    };
    struct {
        unsigned                        :3;
        unsigned T7GGO_NOT_DONE         :1;
    };
    struct {
        unsigned                        :2;
        unsigned T7GVAL                 :1;
        unsigned T7GGO_nDONE            :1;
        unsigned T7GSPM                 :1;
        unsigned T7GTM                  :1;
        unsigned T7GPOL                 :1;
        unsigned T7GE                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned T7GGO                  :1;
    };
} PR7bits_t;
extern volatile PR7bits_t PR7bits __at(0xF31);
// bitfield macros
#define _PR7_GGO_NOT_DONE_POSN                              0x3
#define _PR7_GGO_NOT_DONE_POSITION                          0x3
#define _PR7_GGO_NOT_DONE_SIZE                              0x1
#define _PR7_GGO_NOT_DONE_LENGTH                            0x1
#define _PR7_GGO_NOT_DONE_MASK                              0x8
#define _PR7_GVAL_POSN                                      0x2
#define _PR7_GVAL_POSITION                                  0x2
#define _PR7_GVAL_SIZE                                      0x1
#define _PR7_GVAL_LENGTH                                    0x1
#define _PR7_GVAL_MASK                                      0x4
#define _PR7_GGO_nDONE_POSN                                 0x3
#define _PR7_GGO_nDONE_POSITION                             0x3
#define _PR7_GGO_nDONE_SIZE                                 0x1
#define _PR7_GGO_nDONE_LENGTH                               0x1
#define _PR7_GGO_nDONE_MASK                                 0x8
#define _PR7_GSPM_POSN                                      0x4
#define _PR7_GSPM_POSITION                                  0x4
#define _PR7_GSPM_SIZE                                      0x1
#define _PR7_GSPM_LENGTH                                    0x1
#define _PR7_GSPM_MASK                                      0x10
#define _PR7_GTM_POSN                                       0x5
#define _PR7_GTM_POSITION                                   0x5
#define _PR7_GTM_SIZE                                       0x1
#define _PR7_GTM_LENGTH                                     0x1
#define _PR7_GTM_MASK                                       0x20
#define _PR7_GPOL_POSN                                      0x6
#define _PR7_GPOL_POSITION                                  0x6
#define _PR7_GPOL_SIZE                                      0x1
#define _PR7_GPOL_LENGTH                                    0x1
#define _PR7_GPOL_MASK                                      0x40
#define _PR7_GE_POSN                                        0x7
#define _PR7_GE_POSITION                                    0x7
#define _PR7_GE_SIZE                                        0x1
#define _PR7_GE_LENGTH                                      0x1
#define _PR7_GE_MASK                                        0x80
#define _PR7_T7GGO_NOT_DONE_POSN                            0x3
#define _PR7_T7GGO_NOT_DONE_POSITION                        0x3
#define _PR7_T7GGO_NOT_DONE_SIZE                            0x1
#define _PR7_T7GGO_NOT_DONE_LENGTH                          0x1
#define _PR7_T7GGO_NOT_DONE_MASK                            0x8
#define _PR7_T7GVAL_POSN                                    0x2
#define _PR7_T7GVAL_POSITION                                0x2
#define _PR7_T7GVAL_SIZE                                    0x1
#define _PR7_T7GVAL_LENGTH                                  0x1
#define _PR7_T7GVAL_MASK                                    0x4
#define _PR7_T7GGO_nDONE_POSN                               0x3
#define _PR7_T7GGO_nDONE_POSITION                           0x3
#define _PR7_T7GGO_nDONE_SIZE                               0x1
#define _PR7_T7GGO_nDONE_LENGTH                             0x1
#define _PR7_T7GGO_nDONE_MASK                               0x8
#define _PR7_T7GSPM_POSN                                    0x4
#define _PR7_T7GSPM_POSITION                                0x4
#define _PR7_T7GSPM_SIZE                                    0x1
#define _PR7_T7GSPM_LENGTH                                  0x1
#define _PR7_T7GSPM_MASK                                    0x10
#define _PR7_T7GTM_POSN                                     0x5
#define _PR7_T7GTM_POSITION                                 0x5
#define _PR7_T7GTM_SIZE                                     0x1
#define _PR7_T7GTM_LENGTH                                   0x1
#define _PR7_T7GTM_MASK                                     0x20
#define _PR7_T7GPOL_POSN                                    0x6
#define _PR7_T7GPOL_POSITION                                0x6
#define _PR7_T7GPOL_SIZE                                    0x1
#define _PR7_T7GPOL_LENGTH                                  0x1
#define _PR7_T7GPOL_MASK                                    0x40
#define _PR7_T7GE_POSN                                      0x7
#define _PR7_T7GE_POSITION                                  0x7
#define _PR7_T7GE_SIZE                                      0x1
#define _PR7_T7GE_LENGTH                                    0x1
#define _PR7_T7GE_MASK                                      0x80
#define _PR7_T7GGO_POSN                                     0x3
#define _PR7_T7GGO_POSITION                                 0x3
#define _PR7_T7GGO_SIZE                                     0x1
#define _PR7_T7GGO_LENGTH                                   0x1
#define _PR7_T7GGO_MASK                                     0x8

// Register: T7GATE
#define T7GATE T7GATE
extern volatile unsigned char           T7GATE              __at(0xF32);
#ifndef _LIB_BUILD
asm("T7GATE equ 0F32h");
#endif
// aliases
extern volatile unsigned char           TMR7GATE            __at(0xF32);
#ifndef _LIB_BUILD
asm("TMR7GATE equ 0F32h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GSS                    :5;
    };
    struct {
        unsigned GSS0                   :1;
        unsigned GSS1                   :1;
        unsigned GSS2                   :1;
        unsigned GSS3                   :1;
        unsigned GSS4                   :1;
    };
    struct {
        unsigned T7GSS0                 :1;
        unsigned T7GSS1                 :1;
        unsigned T7GSS2                 :1;
        unsigned T7GSS3                 :1;
        unsigned T7GSS4                 :1;
    };
} T7GATEbits_t;
extern volatile T7GATEbits_t T7GATEbits __at(0xF32);
// bitfield macros
#define _T7GATE_GSS_POSN                                    0x0
#define _T7GATE_GSS_POSITION                                0x0
#define _T7GATE_GSS_SIZE                                    0x5
#define _T7GATE_GSS_LENGTH                                  0x5
#define _T7GATE_GSS_MASK                                    0x1F
#define _T7GATE_GSS0_POSN                                   0x0
#define _T7GATE_GSS0_POSITION                               0x0
#define _T7GATE_GSS0_SIZE                                   0x1
#define _T7GATE_GSS0_LENGTH                                 0x1
#define _T7GATE_GSS0_MASK                                   0x1
#define _T7GATE_GSS1_POSN                                   0x1
#define _T7GATE_GSS1_POSITION                               0x1
#define _T7GATE_GSS1_SIZE                                   0x1
#define _T7GATE_GSS1_LENGTH                                 0x1
#define _T7GATE_GSS1_MASK                                   0x2
#define _T7GATE_GSS2_POSN                                   0x2
#define _T7GATE_GSS2_POSITION                               0x2
#define _T7GATE_GSS2_SIZE                                   0x1
#define _T7GATE_GSS2_LENGTH                                 0x1
#define _T7GATE_GSS2_MASK                                   0x4
#define _T7GATE_GSS3_POSN                                   0x3
#define _T7GATE_GSS3_POSITION                               0x3
#define _T7GATE_GSS3_SIZE                                   0x1
#define _T7GATE_GSS3_LENGTH                                 0x1
#define _T7GATE_GSS3_MASK                                   0x8
#define _T7GATE_GSS4_POSN                                   0x4
#define _T7GATE_GSS4_POSITION                               0x4
#define _T7GATE_GSS4_SIZE                                   0x1
#define _T7GATE_GSS4_LENGTH                                 0x1
#define _T7GATE_GSS4_MASK                                   0x10
#define _T7GATE_T7GSS0_POSN                                 0x0
#define _T7GATE_T7GSS0_POSITION                             0x0
#define _T7GATE_T7GSS0_SIZE                                 0x1
#define _T7GATE_T7GSS0_LENGTH                               0x1
#define _T7GATE_T7GSS0_MASK                                 0x1
#define _T7GATE_T7GSS1_POSN                                 0x1
#define _T7GATE_T7GSS1_POSITION                             0x1
#define _T7GATE_T7GSS1_SIZE                                 0x1
#define _T7GATE_T7GSS1_LENGTH                               0x1
#define _T7GATE_T7GSS1_MASK                                 0x2
#define _T7GATE_T7GSS2_POSN                                 0x2
#define _T7GATE_T7GSS2_POSITION                             0x2
#define _T7GATE_T7GSS2_SIZE                                 0x1
#define _T7GATE_T7GSS2_LENGTH                               0x1
#define _T7GATE_T7GSS2_MASK                                 0x4
#define _T7GATE_T7GSS3_POSN                                 0x3
#define _T7GATE_T7GSS3_POSITION                             0x3
#define _T7GATE_T7GSS3_SIZE                                 0x1
#define _T7GATE_T7GSS3_LENGTH                               0x1
#define _T7GATE_T7GSS3_MASK                                 0x8
#define _T7GATE_T7GSS4_POSN                                 0x4
#define _T7GATE_T7GSS4_POSITION                             0x4
#define _T7GATE_T7GSS4_SIZE                                 0x1
#define _T7GATE_T7GSS4_LENGTH                               0x1
#define _T7GATE_T7GSS4_MASK                                 0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned GSS                    :5;
    };
    struct {
        unsigned GSS0                   :1;
        unsigned GSS1                   :1;
        unsigned GSS2                   :1;
        unsigned GSS3                   :1;
        unsigned GSS4                   :1;
    };
    struct {
        unsigned T7GSS0                 :1;
        unsigned T7GSS1                 :1;
        unsigned T7GSS2                 :1;
        unsigned T7GSS3                 :1;
        unsigned T7GSS4                 :1;
    };
} TMR7GATEbits_t;
