MikroElektronika/core_packages/PIC/XC8/def/PIC18LF66K40/mcu.h
#define                                 ADFLTR10_bit        _BIT_ACCESS(ADFLTRH,2)
// ADFLTRH<ADFLTR11>
extern volatile __bit                   ADFLTR11            __at(0x7B9B);	// @ (0xF73 * 8 + 3)
#define                                 ADFLTR11_bit        _BIT_ACCESS(ADFLTRH,3)
// ADFLTRH<ADFLTR12>
extern volatile __bit                   ADFLTR12            __at(0x7B9C);	// @ (0xF73 * 8 + 4)
#define                                 ADFLTR12_bit        _BIT_ACCESS(ADFLTRH,4)
// ADFLTRH<ADFLTR13>
extern volatile __bit                   ADFLTR13            __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 ADFLTR13_bit        _BIT_ACCESS(ADFLTRH,5)
// ADFLTRH<ADFLTR14>
extern volatile __bit                   ADFLTR14            __at(0x7B9E);	// @ (0xF73 * 8 + 6)
#define                                 ADFLTR14_bit        _BIT_ACCESS(ADFLTRH,6)
// ADFLTRH<ADFLTR15>
extern volatile __bit                   ADFLTR15            __at(0x7B9F);	// @ (0xF73 * 8 + 7)
#define                                 ADFLTR15_bit        _BIT_ACCESS(ADFLTRH,7)
// ADFLTRL<ADFLTR2>
extern volatile __bit                   ADFLTR2             __at(0x7B92);	// @ (0xF72 * 8 + 2)
#define                                 ADFLTR2_bit         _BIT_ACCESS(ADFLTRL,2)
// ADFLTRL<ADFLTR3>
extern volatile __bit                   ADFLTR3             __at(0x7B93);	// @ (0xF72 * 8 + 3)
#define                                 ADFLTR3_bit         _BIT_ACCESS(ADFLTRL,3)
// ADFLTRL<ADFLTR4>
extern volatile __bit                   ADFLTR4             __at(0x7B94);	// @ (0xF72 * 8 + 4)
#define                                 ADFLTR4_bit         _BIT_ACCESS(ADFLTRL,4)
// ADFLTRL<ADFLTR5>
extern volatile __bit                   ADFLTR5             __at(0x7B95);	// @ (0xF72 * 8 + 5)
#define                                 ADFLTR5_bit         _BIT_ACCESS(ADFLTRL,5)
// ADFLTRL<ADFLTR6>
extern volatile __bit                   ADFLTR6             __at(0x7B96);	// @ (0xF72 * 8 + 6)
#define                                 ADFLTR6_bit         _BIT_ACCESS(ADFLTRL,6)
// ADFLTRL<ADFLTR7>
extern volatile __bit                   ADFLTR7             __at(0x7B97);	// @ (0xF72 * 8 + 7)
#define                                 ADFLTR7_bit         _BIT_ACCESS(ADFLTRL,7)
// ADFLTRH<ADFLTR8>
extern volatile __bit                   ADFLTR8             __at(0x7B98);	// @ (0xF73 * 8 + 0)
#define                                 ADFLTR8_bit         _BIT_ACCESS(ADFLTRH,0)
// ADFLTRH<ADFLTR9>
extern volatile __bit                   ADFLTR9             __at(0x7B99);	// @ (0xF73 * 8 + 1)
#define                                 ADFLTR9_bit         _BIT_ACCESS(ADFLTRH,1)
// ADCON0<ADFM>
extern volatile __bit                   ADFM                __at(0x7B02);	// @ (0xF60 * 8 + 2)
#define                                 ADFM_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<ADFM0>
extern volatile __bit                   ADFM0               __at(0x7B02);	// @ (0xF60 * 8 + 2)
#define                                 ADFM0_bit           _BIT_ACCESS(ADCON0,2)
// FVRCON<ADFVR0>
extern volatile __bit                   ADFVR0              __at(0x7620);	// @ (0xEC4 * 8 + 0)
#define                                 ADFVR0_bit          _BIT_ACCESS(FVRCON,0)
// FVRCON<ADFVR1>
extern volatile __bit                   ADFVR1              __at(0x7621);	// @ (0xEC4 * 8 + 1)
#define                                 ADFVR1_bit          _BIT_ACCESS(FVRCON,1)
// ADCON0<ADGO>
extern volatile __bit                   ADGO                __at(0x7B00);	// @ (0xF60 * 8 + 0)
#define                                 ADGO_bit            _BIT_ACCESS(ADCON0,0)
// ADCON1<ADGPOL>
extern volatile __bit                   ADGPOL              __at(0x7ACD);	// @ (0xF59 * 8 + 5)
#define                                 ADGPOL_bit          _BIT_ACCESS(ADCON1,5)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x7150);	// @ (0xE2A * 8 + 0)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,0)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x71A0);	// @ (0xE34 * 8 + 0)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,0)
// IPR1<ADIP>
extern volatile __bit                   ADIP                __at(0x7100);	// @ (0xE20 * 8 + 0)
#define                                 ADIP_bit            _BIT_ACCESS(IPR1,0)
// ADCON1<ADIPEN>
extern volatile __bit                   ADIPEN              __at(0x7ACE);	// @ (0xF59 * 8 + 6)
#define                                 ADIPEN_bit          _BIT_ACCESS(ADCON1,6)
// ADLTHL<ADLTH0>
extern volatile __bit                   ADLTH0              __at(0x7B50);	// @ (0xF6A * 8 + 0)
#define                                 ADLTH0_bit          _BIT_ACCESS(ADLTHL,0)
// ADLTHL<ADLTH1>
extern volatile __bit                   ADLTH1              __at(0x7B51);	// @ (0xF6A * 8 + 1)
#define                                 ADLTH1_bit          _BIT_ACCESS(ADLTHL,1)
// ADLTHH<ADLTH10>
extern volatile __bit                   ADLTH10             __at(0x7B5A);	// @ (0xF6B * 8 + 2)
#define                                 ADLTH10_bit         _BIT_ACCESS(ADLTHH,2)
// ADLTHH<ADLTH11>
extern volatile __bit                   ADLTH11             __at(0x7B5B);	// @ (0xF6B * 8 + 3)
#define                                 ADLTH11_bit         _BIT_ACCESS(ADLTHH,3)
// ADLTHH<ADLTH12>
extern volatile __bit                   ADLTH12             __at(0x7B5C);	// @ (0xF6B * 8 + 4)
#define                                 ADLTH12_bit         _BIT_ACCESS(ADLTHH,4)
// ADLTHH<ADLTH13>
extern volatile __bit                   ADLTH13             __at(0x7B5D);	// @ (0xF6B * 8 + 5)
#define                                 ADLTH13_bit         _BIT_ACCESS(ADLTHH,5)
// ADLTHH<ADLTH14>
extern volatile __bit                   ADLTH14             __at(0x7B5E);	// @ (0xF6B * 8 + 6)
#define                                 ADLTH14_bit         _BIT_ACCESS(ADLTHH,6)
// ADLTHH<ADLTH15>
extern volatile __bit                   ADLTH15             __at(0x7B5F);	// @ (0xF6B * 8 + 7)
#define                                 ADLTH15_bit         _BIT_ACCESS(ADLTHH,7)
// ADLTHL<ADLTH2>
extern volatile __bit                   ADLTH2              __at(0x7B52);	// @ (0xF6A * 8 + 2)
#define                                 ADLTH2_bit          _BIT_ACCESS(ADLTHL,2)
// ADLTHL<ADLTH3>
extern volatile __bit                   ADLTH3              __at(0x7B53);	// @ (0xF6A * 8 + 3)
#define                                 ADLTH3_bit          _BIT_ACCESS(ADLTHL,3)
// ADLTHL<ADLTH4>
extern volatile __bit                   ADLTH4              __at(0x7B54);	// @ (0xF6A * 8 + 4)
#define                                 ADLTH4_bit          _BIT_ACCESS(ADLTHL,4)
// ADLTHL<ADLTH5>
extern volatile __bit                   ADLTH5              __at(0x7B55);	// @ (0xF6A * 8 + 5)
#define                                 ADLTH5_bit          _BIT_ACCESS(ADLTHL,5)
// ADLTHL<ADLTH6>
extern volatile __bit                   ADLTH6              __at(0x7B56);	// @ (0xF6A * 8 + 6)
#define                                 ADLTH6_bit          _BIT_ACCESS(ADLTHL,6)
// ADLTHL<ADLTH7>
extern volatile __bit                   ADLTH7              __at(0x7B57);	// @ (0xF6A * 8 + 7)
#define                                 ADLTH7_bit          _BIT_ACCESS(ADLTHL,7)
// ADLTHH<ADLTH8>
extern volatile __bit                   ADLTH8              __at(0x7B58);	// @ (0xF6B * 8 + 0)
#define                                 ADLTH8_bit          _BIT_ACCESS(ADLTHH,0)
// ADLTHH<ADLTH9>
extern volatile __bit                   ADLTH9              __at(0x7B59);	// @ (0xF6B * 8 + 1)
#define                                 ADLTH9_bit          _BIT_ACCESS(ADLTHH,1)
// ADSTAT<ADLTHR>
extern volatile __bit                   ADLTHR              __at(0x7B2D);	// @ (0xF65 * 8 + 5)
#define                                 ADLTHR_bit          _BIT_ACCESS(ADSTAT,5)
// ADSTAT<ADMATH>
extern volatile __bit                   ADMATH              __at(0x7B2C);	// @ (0xF65 * 8 + 4)
#define                                 ADMATH_bit          _BIT_ACCESS(ADSTAT,4)
// ADCON2<ADMD0>
extern volatile __bit                   ADMD0               __at(0x7AD0);	// @ (0xF5A * 8 + 0)
#define                                 ADMD0_bit           _BIT_ACCESS(ADCON2,0)
// ADCON2<ADMD1>
extern volatile __bit                   ADMD1               __at(0x7AD1);	// @ (0xF5A * 8 + 1)
#define                                 ADMD1_bit           _BIT_ACCESS(ADCON2,1)
// ADCON2<ADMD2>
extern volatile __bit                   ADMD2               __at(0x7AD2);	// @ (0xF5A * 8 + 2)
#define                                 ADMD2_bit           _BIT_ACCESS(ADCON2,2)
// SSP1CON2<ADMSK11>
extern volatile __bit                   ADMSK11             __at(0x7CB1);	// @ (0xF96 * 8 + 1)
#define                                 ADMSK11_bit         _BIT_ACCESS(SSP1CON2,1)
// SSP2CON2<ADMSK12>
extern volatile __bit                   ADMSK12             __at(0x76D1);	// @ (0xEDA * 8 + 1)
#define                                 ADMSK12_bit         _BIT_ACCESS(SSP2CON2,1)
// SSP1CON2<ADMSK21>
extern volatile __bit                   ADMSK21             __at(0x7CB2);	// @ (0xF96 * 8 + 2)
#define                                 ADMSK21_bit         _BIT_ACCESS(SSP1CON2,2)
// SSP2CON2<ADMSK22>
extern volatile __bit                   ADMSK22             __at(0x76D2);	// @ (0xEDA * 8 + 2)
#define                                 ADMSK22_bit         _BIT_ACCESS(SSP2CON2,2)
// SSP1CON2<ADMSK31>
extern volatile __bit                   ADMSK31             __at(0x7CB3);	// @ (0xF96 * 8 + 3)
#define                                 ADMSK31_bit         _BIT_ACCESS(SSP1CON2,3)
// SSP2CON2<ADMSK32>
extern volatile __bit                   ADMSK32             __at(0x76D3);	// @ (0xEDA * 8 + 3)
#define                                 ADMSK32_bit         _BIT_ACCESS(SSP2CON2,3)
// SSP1CON2<ADMSK41>
extern volatile __bit                   ADMSK41             __at(0x7CB4);	// @ (0xF96 * 8 + 4)
#define                                 ADMSK41_bit         _BIT_ACCESS(SSP1CON2,4)
// SSP2CON2<ADMSK42>
extern volatile __bit                   ADMSK42             __at(0x76D4);	// @ (0xEDA * 8 + 4)
#define                                 ADMSK42_bit         _BIT_ACCESS(SSP2CON2,4)
// SSP1CON2<ADMSK51>
extern volatile __bit                   ADMSK51             __at(0x7CB5);	// @ (0xF96 * 8 + 5)
#define                                 ADMSK51_bit         _BIT_ACCESS(SSP1CON2,5)
// SSP2CON2<ADMSK52>
extern volatile __bit                   ADMSK52             __at(0x76D5);	// @ (0xEDA * 8 + 5)
#define                                 ADMSK52_bit         _BIT_ACCESS(SSP2CON2,5)
// ADREF<ADNREF>
extern volatile __bit                   ADNREF              __at(0x7AC4);	// @ (0xF58 * 8 + 4)
#define                                 ADNREF_bit          _BIT_ACCESS(ADREF,4)
// OSCEN<ADOEN>
extern volatile __bit                   ADOEN               __at(0x723A);	// @ (0xE47 * 8 + 2)
#define                                 ADOEN_bit           _BIT_ACCESS(OSCEN,2)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x7B07);	// @ (0xF60 * 8 + 7)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,7)
// OSCSTAT<ADOR>
extern volatile __bit                   ADOR                __at(0x7232);	// @ (0xE46 * 8 + 2)
#define                                 ADOR_bit            _BIT_ACCESS(OSCSTAT,2)
// ADPCH<ADPCH0>
extern volatile __bit                   ADPCH0              __at(0x7AF8);	// @ (0xF5F * 8 + 0)
#define                                 ADPCH0_bit          _BIT_ACCESS(ADPCH,0)
// ADPCH<ADPCH1>
extern volatile __bit                   ADPCH1              __at(0x7AF9);	// @ (0xF5F * 8 + 1)
#define                                 ADPCH1_bit          _BIT_ACCESS(ADPCH,1)
// ADPCH<ADPCH2>
extern volatile __bit                   ADPCH2              __at(0x7AFA);	// @ (0xF5F * 8 + 2)
#define                                 ADPCH2_bit          _BIT_ACCESS(ADPCH,2)
// ADPCH<ADPCH3>
extern volatile __bit                   ADPCH3              __at(0x7AFB);	// @ (0xF5F * 8 + 3)
#define                                 ADPCH3_bit          _BIT_ACCESS(ADPCH,3)
// ADPCH<ADPCH4>
extern volatile __bit                   ADPCH4              __at(0x7AFC);	// @ (0xF5F * 8 + 4)
#define                                 ADPCH4_bit          _BIT_ACCESS(ADPCH,4)
// ADPCH<ADPCH5>
extern volatile __bit                   ADPCH5              __at(0x7AFD);	// @ (0xF5F * 8 + 5)
#define                                 ADPCH5_bit          _BIT_ACCESS(ADPCH,5)
// ADCON1<ADPPOL>
extern volatile __bit                   ADPPOL              __at(0x7ACF);	// @ (0xF59 * 8 + 7)
#define                                 ADPPOL_bit          _BIT_ACCESS(ADCON1,7)
// ADPRE<ADPRE0>
extern volatile __bit                   ADPRE0              __at(0x7AF0);	// @ (0xF5E * 8 + 0)
#define                                 ADPRE0_bit          _BIT_ACCESS(ADPRE,0)
// ADPRE<ADPRE1>
extern volatile __bit                   ADPRE1              __at(0x7AF1);	// @ (0xF5E * 8 + 1)
#define                                 ADPRE1_bit          _BIT_ACCESS(ADPRE,1)
// ADPRE<ADPRE2>
extern volatile __bit                   ADPRE2              __at(0x7AF2);	// @ (0xF5E * 8 + 2)
#define                                 ADPRE2_bit          _BIT_ACCESS(ADPRE,2)
// ADPRE<ADPRE3>
extern volatile __bit                   ADPRE3              __at(0x7AF3);	// @ (0xF5E * 8 + 3)
#define                                 ADPRE3_bit          _BIT_ACCESS(ADPRE,3)
// ADPRE<ADPRE4>
extern volatile __bit                   ADPRE4              __at(0x7AF4);	// @ (0xF5E * 8 + 4)
#define                                 ADPRE4_bit          _BIT_ACCESS(ADPRE,4)
// ADPRE<ADPRE5>
extern volatile __bit                   ADPRE5              __at(0x7AF5);	// @ (0xF5E * 8 + 5)
#define                                 ADPRE5_bit          _BIT_ACCESS(ADPRE,5)
// ADPRE<ADPRE6>
extern volatile __bit                   ADPRE6              __at(0x7AF6);	// @ (0xF5E * 8 + 6)
#define                                 ADPRE6_bit          _BIT_ACCESS(ADPRE,6)
// ADPRE<ADPRE7>
extern volatile __bit                   ADPRE7              __at(0x7AF7);	// @ (0xF5E * 8 + 7)
#define                                 ADPRE7_bit          _BIT_ACCESS(ADPRE,7)
// ADREF<ADPREF0>
extern volatile __bit                   ADPREF0             __at(0x7AC0);	// @ (0xF58 * 8 + 0)
#define                                 ADPREF0_bit         _BIT_ACCESS(ADREF,0)
// ADREF<ADPREF1>
extern volatile __bit                   ADPREF1             __at(0x7AC1);	// @ (0xF58 * 8 + 1)
#define                                 ADPREF1_bit         _BIT_ACCESS(ADREF,1)
// ADPREVL<ADPREV0>
extern volatile __bit                   ADPREV0             __at(0x7B08);	// @ (0xF61 * 8 + 0)
#define                                 ADPREV0_bit         _BIT_ACCESS(ADPREVL,0)
// ADPREVL<ADPREV1>
extern volatile __bit                   ADPREV1             __at(0x7B09);	// @ (0xF61 * 8 + 1)
#define                                 ADPREV1_bit         _BIT_ACCESS(ADPREVL,1)
// ADPREVH<ADPREV10>
extern volatile __bit                   ADPREV10            __at(0x7B12);	// @ (0xF62 * 8 + 2)
#define                                 ADPREV10_bit        _BIT_ACCESS(ADPREVH,2)
// ADPREVH<ADPREV11>
extern volatile __bit                   ADPREV11            __at(0x7B13);	// @ (0xF62 * 8 + 3)
#define                                 ADPREV11_bit        _BIT_ACCESS(ADPREVH,3)
// ADPREVH<ADPREV12>
extern volatile __bit                   ADPREV12            __at(0x7B14);	// @ (0xF62 * 8 + 4)
#define                                 ADPREV12_bit        _BIT_ACCESS(ADPREVH,4)
// ADPREVH<ADPREV13>
extern volatile __bit                   ADPREV13            __at(0x7B15);	// @ (0xF62 * 8 + 5)
#define                                 ADPREV13_bit        _BIT_ACCESS(ADPREVH,5)
// ADPREVH<ADPREV14>
extern volatile __bit                   ADPREV14            __at(0x7B16);	// @ (0xF62 * 8 + 6)
#define                                 ADPREV14_bit        _BIT_ACCESS(ADPREVH,6)
// ADPREVH<ADPREV15>
extern volatile __bit                   ADPREV15            __at(0x7B17);	// @ (0xF62 * 8 + 7)
#define                                 ADPREV15_bit        _BIT_ACCESS(ADPREVH,7)
// ADPREVL<ADPREV2>
extern volatile __bit                   ADPREV2             __at(0x7B0A);	// @ (0xF61 * 8 + 2)
#define                                 ADPREV2_bit         _BIT_ACCESS(ADPREVL,2)
// ADPREVL<ADPREV3>
extern volatile __bit                   ADPREV3             __at(0x7B0B);	// @ (0xF61 * 8 + 3)
#define                                 ADPREV3_bit         _BIT_ACCESS(ADPREVL,3)
// ADPREVL<ADPREV4>
extern volatile __bit                   ADPREV4             __at(0x7B0C);	// @ (0xF61 * 8 + 4)
#define                                 ADPREV4_bit         _BIT_ACCESS(ADPREVL,4)
// ADPREVL<ADPREV5>
extern volatile __bit                   ADPREV5             __at(0x7B0D);	// @ (0xF61 * 8 + 5)
#define                                 ADPREV5_bit         _BIT_ACCESS(ADPREVL,5)
// ADPREVL<ADPREV6>
extern volatile __bit                   ADPREV6             __at(0x7B0E);	// @ (0xF61 * 8 + 6)
#define                                 ADPREV6_bit         _BIT_ACCESS(ADPREVL,6)
// ADPREVL<ADPREV7>
extern volatile __bit                   ADPREV7             __at(0x7B0F);	// @ (0xF61 * 8 + 7)
#define                                 ADPREV7_bit         _BIT_ACCESS(ADPREVL,7)
// ADPREVH<ADPREV8>
extern volatile __bit                   ADPREV8             __at(0x7B10);	// @ (0xF62 * 8 + 0)
#define                                 ADPREV8_bit         _BIT_ACCESS(ADPREVH,0)
// ADPREVH<ADPREV9>
extern volatile __bit                   ADPREV9             __at(0x7B11);	// @ (0xF62 * 8 + 1)
#define                                 ADPREV9_bit         _BIT_ACCESS(ADPREVH,1)
// ADCON2<ADPSIS>
extern volatile __bit                   ADPSIS              __at(0x7AD7);	// @ (0xF5A * 8 + 7)
#define                                 ADPSIS_bit          _BIT_ACCESS(ADCON2,7)
// NVMADRL<ADR0>
extern volatile __bit                   ADR0                __at(0x7BA0);	// @ (0xF74 * 8 + 0)
#define                                 ADR0_bit            _BIT_ACCESS(NVMADRL,0)
// NVMADRL<ADR1>
extern volatile __bit                   ADR1                __at(0x7BA1);	// @ (0xF74 * 8 + 1)
#define                                 ADR1_bit            _BIT_ACCESS(NVMADRL,1)
// NVMADRL<ADR2>
extern volatile __bit                   ADR2                __at(0x7BA2);	// @ (0xF74 * 8 + 2)
#define                                 ADR2_bit            _BIT_ACCESS(NVMADRL,2)
// NVMADRL<ADR3>
extern volatile __bit                   ADR3                __at(0x7BA3);	// @ (0xF74 * 8 + 3)
#define                                 ADR3_bit            _BIT_ACCESS(NVMADRL,3)
// NVMADRL<ADR4>
extern volatile __bit                   ADR4                __at(0x7BA4);	// @ (0xF74 * 8 + 4)
#define                                 ADR4_bit            _BIT_ACCESS(NVMADRL,4)
// NVMADRL<ADR5>
extern volatile __bit                   ADR5                __at(0x7BA5);	// @ (0xF74 * 8 + 5)
#define                                 ADR5_bit            _BIT_ACCESS(NVMADRL,5)
// NVMADRL<ADR6>
extern volatile __bit                   ADR6                __at(0x7BA6);	// @ (0xF74 * 8 + 6)
#define                                 ADR6_bit            _BIT_ACCESS(NVMADRL,6)
// NVMADRL<ADR7>
extern volatile __bit                   ADR7                __at(0x7BA7);	// @ (0xF74 * 8 + 7)
#define                                 ADR7_bit            _BIT_ACCESS(NVMADRL,7)
// NVMADRH<ADR8>
extern volatile __bit                   ADR8                __at(0x7BA8);	// @ (0xF75 * 8 + 0)
#define                                 ADR8_bit            _BIT_ACCESS(NVMADRH,0)
// NVMADRH<ADR9>
extern volatile __bit                   ADR9                __at(0x7BA9);	// @ (0xF75 * 8 + 1)
#define                                 ADR9_bit            _BIT_ACCESS(NVMADRH,1)
// ADRESL<ADRES0>
extern volatile __bit                   ADRES0              __at(0x7B18);	// @ (0xF63 * 8 + 0)
#define                                 ADRES0_bit          _BIT_ACCESS(ADRESL,0)
// ADRESL<ADRES1>
extern volatile __bit                   ADRES1              __at(0x7B19);	// @ (0xF63 * 8 + 1)
#define                                 ADRES1_bit          _BIT_ACCESS(ADRESL,1)
// ADRESH<ADRES10>
extern volatile __bit                   ADRES10             __at(0x7B22);	// @ (0xF64 * 8 + 2)
#define                                 ADRES10_bit         _BIT_ACCESS(ADRESH,2)
// ADRESH<ADRES11>
extern volatile __bit                   ADRES11             __at(0x7B23);	// @ (0xF64 * 8 + 3)
#define                                 ADRES11_bit         _BIT_ACCESS(ADRESH,3)
// ADRESH<ADRES12>
extern volatile __bit                   ADRES12             __at(0x7B24);	// @ (0xF64 * 8 + 4)
#define                                 ADRES12_bit         _BIT_ACCESS(ADRESH,4)
// ADRESH<ADRES13>
extern volatile __bit                   ADRES13             __at(0x7B25);	// @ (0xF64 * 8 + 5)
#define                                 ADRES13_bit         _BIT_ACCESS(ADRESH,5)
// ADRESH<ADRES14>
extern volatile __bit                   ADRES14             __at(0x7B26);	// @ (0xF64 * 8 + 6)
#define                                 ADRES14_bit         _BIT_ACCESS(ADRESH,6)
// ADRESH<ADRES15>
extern volatile __bit                   ADRES15             __at(0x7B27);	// @ (0xF64 * 8 + 7)
#define                                 ADRES15_bit         _BIT_ACCESS(ADRESH,7)
// ADRESL<ADRES2>
extern volatile __bit                   ADRES2              __at(0x7B1A);	// @ (0xF63 * 8 + 2)
#define                                 ADRES2_bit          _BIT_ACCESS(ADRESL,2)
// ADRESL<ADRES3>
extern volatile __bit                   ADRES3              __at(0x7B1B);	// @ (0xF63 * 8 + 3)
#define                                 ADRES3_bit          _BIT_ACCESS(ADRESL,3)
// ADRESL<ADRES4>
extern volatile __bit                   ADRES4              __at(0x7B1C);	// @ (0xF63 * 8 + 4)
#define                                 ADRES4_bit          _BIT_ACCESS(ADRESL,4)
// ADRESL<ADRES5>
extern volatile __bit                   ADRES5              __at(0x7B1D);	// @ (0xF63 * 8 + 5)
#define                                 ADRES5_bit          _BIT_ACCESS(ADRESL,5)
// ADRESL<ADRES6>
extern volatile __bit                   ADRES6              __at(0x7B1E);	// @ (0xF63 * 8 + 6)
#define                                 ADRES6_bit          _BIT_ACCESS(ADRESL,6)
// ADRESL<ADRES7>
extern volatile __bit                   ADRES7              __at(0x7B1F);	// @ (0xF63 * 8 + 7)
#define                                 ADRES7_bit          _BIT_ACCESS(ADRESL,7)
// ADRESH<ADRES8>
extern volatile __bit                   ADRES8              __at(0x7B20);	// @ (0xF64 * 8 + 0)
#define                                 ADRES8_bit          _BIT_ACCESS(ADRESH,0)
// ADRESH<ADRES9>
extern volatile __bit                   ADRES9              __at(0x7B21);	// @ (0xF64 * 8 + 1)
#define                                 ADRES9_bit          _BIT_ACCESS(ADRESH,1)
// ADRPT<ADRPT0>
extern volatile __bit                   ADRPT0              __at(0x7B30);	// @ (0xF66 * 8 + 0)
#define                                 ADRPT0_bit          _BIT_ACCESS(ADRPT,0)
// ADRPT<ADRPT1>
extern volatile __bit                   ADRPT1              __at(0x7B31);	// @ (0xF66 * 8 + 1)
#define                                 ADRPT1_bit          _BIT_ACCESS(ADRPT,1)
// ADRPT<ADRPT2>
extern volatile __bit                   ADRPT2              __at(0x7B32);	// @ (0xF66 * 8 + 2)
#define                                 ADRPT2_bit          _BIT_ACCESS(ADRPT,2)
// ADRPT<ADRPT3>
extern volatile __bit                   ADRPT3              __at(0x7B33);	// @ (0xF66 * 8 + 3)
#define                                 ADRPT3_bit          _BIT_ACCESS(ADRPT,3)
// ADRPT<ADRPT4>
