MikroElektronika/core_packages/PIC/XC8/def/PIC18LF66K40/mcu.h
#define                                 C1IP_bit            _BIT_ACCESS(IPR2,0)
// CM1NCH<C1NCH0>
extern volatile __bit                   C1NCH0              __at(0x7690);	// @ (0xED2 * 8 + 0)
#define                                 C1NCH0_bit          _BIT_ACCESS(CM1NCH,0)
// CM1NCH<C1NCH1>
extern volatile __bit                   C1NCH1              __at(0x7691);	// @ (0xED2 * 8 + 1)
#define                                 C1NCH1_bit          _BIT_ACCESS(CM1NCH,1)
// CM1NCH<C1NCH2>
extern volatile __bit                   C1NCH2              __at(0x7692);	// @ (0xED2 * 8 + 2)
#define                                 C1NCH2_bit          _BIT_ACCESS(CM1NCH,2)
// CM1CON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0x7686);	// @ (0xED0 * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CM1CON0,6)
// PORTF<C1OUTF>
extern volatile __bit                   C1OUTF              __at(0x7C72);	// @ (0xF8E * 8 + 2)
#define                                 C1OUTF_bit          _BIT_ACCESS(PORTF,2)
// CM1PCH<C1PCH0>
extern volatile __bit                   C1PCH0              __at(0x7698);	// @ (0xED3 * 8 + 0)
#define                                 C1PCH0_bit          _BIT_ACCESS(CM1PCH,0)
// CM1PCH<C1PCH1>
extern volatile __bit                   C1PCH1              __at(0x7699);	// @ (0xED3 * 8 + 1)
#define                                 C1PCH1_bit          _BIT_ACCESS(CM1PCH,1)
// CM1PCH<C1PCH2>
extern volatile __bit                   C1PCH2              __at(0x769A);	// @ (0xED3 * 8 + 2)
#define                                 C1PCH2_bit          _BIT_ACCESS(CM1PCH,2)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x7684);	// @ (0xED0 * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// CM1CON0<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x7680);	// @ (0xED0 * 8 + 0)
#define                                 C1SYNC_bit          _BIT_ACCESS(CM1CON0,0)
// CCPTMRS0<C1TSEL0>
extern volatile __bit                   C1TSEL0             __at(0x7D68);	// @ (0xFAD * 8 + 0)
#define                                 C1TSEL0_bit         _BIT_ACCESS(CCPTMRS0,0)
// CCPTMRS0<C1TSEL1>
extern volatile __bit                   C1TSEL1             __at(0x7D69);	// @ (0xFAD * 8 + 1)
#define                                 C1TSEL1_bit         _BIT_ACCESS(CCPTMRS0,1)
// CM2CON0<C2EN>
extern volatile __bit                   C2EN                __at(0x7667);	// @ (0xECC * 8 + 7)
#define                                 C2EN_bit            _BIT_ACCESS(CM2CON0,7)
// CM2CON0<C2HYS>
extern volatile __bit                   C2HYS               __at(0x7661);	// @ (0xECC * 8 + 1)
#define                                 C2HYS_bit           _BIT_ACCESS(CM2CON0,1)
// PIE2<C2IE>
extern volatile __bit                   C2IE                __at(0x7159);	// @ (0xE2B * 8 + 1)
#define                                 C2IE_bit            _BIT_ACCESS(PIE2,1)
// PIR2<C2IF>
extern volatile __bit                   C2IF                __at(0x71A9);	// @ (0xE35 * 8 + 1)
#define                                 C2IF_bit            _BIT_ACCESS(PIR2,1)
// CM2CON1<C2INTN>
extern volatile __bit                   C2INTN              __at(0x7668);	// @ (0xECD * 8 + 0)
#define                                 C2INTN_bit          _BIT_ACCESS(CM2CON1,0)
// CM2CON1<C2INTP>
extern volatile __bit                   C2INTP              __at(0x7669);	// @ (0xECD * 8 + 1)
#define                                 C2INTP_bit          _BIT_ACCESS(CM2CON1,1)
// IPR2<C2IP>
extern volatile __bit                   C2IP                __at(0x7109);	// @ (0xE21 * 8 + 1)
#define                                 C2IP_bit            _BIT_ACCESS(IPR2,1)
// CM2NCH<C2NCH0>
extern volatile __bit                   C2NCH0              __at(0x7670);	// @ (0xECE * 8 + 0)
#define                                 C2NCH0_bit          _BIT_ACCESS(CM2NCH,0)
// CM2NCH<C2NCH1>
extern volatile __bit                   C2NCH1              __at(0x7671);	// @ (0xECE * 8 + 1)
#define                                 C2NCH1_bit          _BIT_ACCESS(CM2NCH,1)
// CM2NCH<C2NCH2>
extern volatile __bit                   C2NCH2              __at(0x7672);	// @ (0xECE * 8 + 2)
#define                                 C2NCH2_bit          _BIT_ACCESS(CM2NCH,2)
// CM2CON0<C2OUT>
extern volatile __bit                   C2OUT               __at(0x7666);	// @ (0xECC * 8 + 6)
#define                                 C2OUT_bit           _BIT_ACCESS(CM2CON0,6)
// PORTF<C2OUTF>
extern volatile __bit                   C2OUTF              __at(0x7C71);	// @ (0xF8E * 8 + 1)
#define                                 C2OUTF_bit          _BIT_ACCESS(PORTF,1)
// CM2PCH<C2PCH0>
extern volatile __bit                   C2PCH0              __at(0x7678);	// @ (0xECF * 8 + 0)
#define                                 C2PCH0_bit          _BIT_ACCESS(CM2PCH,0)
// CM2PCH<C2PCH1>
extern volatile __bit                   C2PCH1              __at(0x7679);	// @ (0xECF * 8 + 1)
#define                                 C2PCH1_bit          _BIT_ACCESS(CM2PCH,1)
// CM2PCH<C2PCH2>
extern volatile __bit                   C2PCH2              __at(0x767A);	// @ (0xECF * 8 + 2)
#define                                 C2PCH2_bit          _BIT_ACCESS(CM2PCH,2)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x7664);	// @ (0xECC * 8 + 4)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,4)
// CM2CON0<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x7660);	// @ (0xECC * 8 + 0)
#define                                 C2SYNC_bit          _BIT_ACCESS(CM2CON0,0)
// CCPTMRS0<C2TSEL0>
extern volatile __bit                   C2TSEL0             __at(0x7D6A);	// @ (0xFAD * 8 + 2)
#define                                 C2TSEL0_bit         _BIT_ACCESS(CCPTMRS0,2)
// CCPTMRS0<C2TSEL1>
extern volatile __bit                   C2TSEL1             __at(0x7D6B);	// @ (0xFAD * 8 + 3)
#define                                 C2TSEL1_bit         _BIT_ACCESS(CCPTMRS0,3)
// CM3CON0<C3EN>
extern volatile __bit                   C3EN                __at(0x7647);	// @ (0xEC8 * 8 + 7)
#define                                 C3EN_bit            _BIT_ACCESS(CM3CON0,7)
// CM3CON0<C3HYS>
extern volatile __bit                   C3HYS               __at(0x7641);	// @ (0xEC8 * 8 + 1)
#define                                 C3HYS_bit           _BIT_ACCESS(CM3CON0,1)
// PIE2<C3IE>
extern volatile __bit                   C3IE                __at(0x715A);	// @ (0xE2B * 8 + 2)
#define                                 C3IE_bit            _BIT_ACCESS(PIE2,2)
// PIR2<C3IF>
extern volatile __bit                   C3IF                __at(0x71AA);	// @ (0xE35 * 8 + 2)
#define                                 C3IF_bit            _BIT_ACCESS(PIR2,2)
// CM3CON1<C3INTN>
extern volatile __bit                   C3INTN              __at(0x7648);	// @ (0xEC9 * 8 + 0)
#define                                 C3INTN_bit          _BIT_ACCESS(CM3CON1,0)
// CM3CON1<C3INTP>
extern volatile __bit                   C3INTP              __at(0x7649);	// @ (0xEC9 * 8 + 1)
#define                                 C3INTP_bit          _BIT_ACCESS(CM3CON1,1)
// IPR2<C3IP>
extern volatile __bit                   C3IP                __at(0x710A);	// @ (0xE21 * 8 + 2)
#define                                 C3IP_bit            _BIT_ACCESS(IPR2,2)
// CM3NCH<C3NCH0>
extern volatile __bit                   C3NCH0              __at(0x7650);	// @ (0xECA * 8 + 0)
#define                                 C3NCH0_bit          _BIT_ACCESS(CM3NCH,0)
// CM3NCH<C3NCH1>
extern volatile __bit                   C3NCH1              __at(0x7651);	// @ (0xECA * 8 + 1)
#define                                 C3NCH1_bit          _BIT_ACCESS(CM3NCH,1)
// CM3NCH<C3NCH2>
extern volatile __bit                   C3NCH2              __at(0x7652);	// @ (0xECA * 8 + 2)
#define                                 C3NCH2_bit          _BIT_ACCESS(CM3NCH,2)
// CM3CON0<C3OUT>
extern volatile __bit                   C3OUT               __at(0x7646);	// @ (0xEC8 * 8 + 6)
#define                                 C3OUT_bit           _BIT_ACCESS(CM3CON0,6)
// PORTG<C3OUTG>
extern volatile __bit                   C3OUTG              __at(0x7C79);	// @ (0xF8F * 8 + 1)
#define                                 C3OUTG_bit          _BIT_ACCESS(PORTG,1)
// CM3PCH<C3PCH0>
extern volatile __bit                   C3PCH0              __at(0x7658);	// @ (0xECB * 8 + 0)
#define                                 C3PCH0_bit          _BIT_ACCESS(CM3PCH,0)
// CM3PCH<C3PCH1>
extern volatile __bit                   C3PCH1              __at(0x7659);	// @ (0xECB * 8 + 1)
#define                                 C3PCH1_bit          _BIT_ACCESS(CM3PCH,1)
// CM3PCH<C3PCH2>
extern volatile __bit                   C3PCH2              __at(0x765A);	// @ (0xECB * 8 + 2)
#define                                 C3PCH2_bit          _BIT_ACCESS(CM3PCH,2)
// CM3CON0<C3POL>
extern volatile __bit                   C3POL               __at(0x7644);	// @ (0xEC8 * 8 + 4)
#define                                 C3POL_bit           _BIT_ACCESS(CM3CON0,4)
// CM3CON0<C3SYNC>
extern volatile __bit                   C3SYNC              __at(0x7640);	// @ (0xEC8 * 8 + 0)
#define                                 C3SYNC_bit          _BIT_ACCESS(CM3CON0,0)
// CCPTMRS0<C3TSEL0>
extern volatile __bit                   C3TSEL0             __at(0x7D6C);	// @ (0xFAD * 8 + 4)
#define                                 C3TSEL0_bit         _BIT_ACCESS(CCPTMRS0,4)
// CCPTMRS0<C3TSEL1>
extern volatile __bit                   C3TSEL1             __at(0x7D6D);	// @ (0xFAD * 8 + 5)
#define                                 C3TSEL1_bit         _BIT_ACCESS(CCPTMRS0,5)
// CCPTMRS0<C4TSEL0>
extern volatile __bit                   C4TSEL0             __at(0x7D6E);	// @ (0xFAD * 8 + 6)
#define                                 C4TSEL0_bit         _BIT_ACCESS(CCPTMRS0,6)
// CCPTMRS0<C4TSEL1>
extern volatile __bit                   C4TSEL1             __at(0x7D6F);	// @ (0xFAD * 8 + 7)
#define                                 C4TSEL1_bit         _BIT_ACCESS(CCPTMRS0,7)
// CCPTMRS1<C5TSEL0>
extern volatile __bit                   C5TSEL0             __at(0x7D70);	// @ (0xFAE * 8 + 0)
#define                                 C5TSEL0_bit         _BIT_ACCESS(CCPTMRS1,0)
// CCPTMRS1<C5TSEL1>
extern volatile __bit                   C5TSEL1             __at(0x7D71);	// @ (0xFAE * 8 + 1)
#define                                 C5TSEL1_bit         _BIT_ACCESS(CCPTMRS1,1)
// TMR1L<CAL01>
extern volatile __bit                   CAL01               __at(0x7E68);	// @ (0xFCD * 8 + 0)
#define                                 CAL01_bit           _BIT_ACCESS(TMR1L,0)
// TMR3L<CAL03>
extern volatile __bit                   CAL03               __at(0x7E38);	// @ (0xFC7 * 8 + 0)
#define                                 CAL03_bit           _BIT_ACCESS(TMR3L,0)
// TMR5L<CAL05>
extern volatile __bit                   CAL05               __at(0x7E08);	// @ (0xFC1 * 8 + 0)
#define                                 CAL05_bit           _BIT_ACCESS(TMR5L,0)
// TMR7L<CAL07>
extern volatile __bit                   CAL07               __at(0x7970);	// @ (0xF2E * 8 + 0)
#define                                 CAL07_bit           _BIT_ACCESS(TMR7L,0)
// TMR1L<CAL11>
extern volatile __bit                   CAL11               __at(0x7E69);	// @ (0xFCD * 8 + 1)
#define                                 CAL11_bit           _BIT_ACCESS(TMR1L,1)
// TMR3L<CAL13>
extern volatile __bit                   CAL13               __at(0x7E39);	// @ (0xFC7 * 8 + 1)
#define                                 CAL13_bit           _BIT_ACCESS(TMR3L,1)
// TMR5L<CAL15>
extern volatile __bit                   CAL15               __at(0x7E09);	// @ (0xFC1 * 8 + 1)
#define                                 CAL15_bit           _BIT_ACCESS(TMR5L,1)
// TMR7L<CAL17>
extern volatile __bit                   CAL17               __at(0x7971);	// @ (0xF2E * 8 + 1)
#define                                 CAL17_bit           _BIT_ACCESS(TMR7L,1)
// TMR1L<CAL21>
extern volatile __bit                   CAL21               __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 CAL21_bit           _BIT_ACCESS(TMR1L,2)
// TMR3L<CAL23>
extern volatile __bit                   CAL23               __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 CAL23_bit           _BIT_ACCESS(TMR3L,2)
// TMR5L<CAL25>
extern volatile __bit                   CAL25               __at(0x7E0A);	// @ (0xFC1 * 8 + 2)
#define                                 CAL25_bit           _BIT_ACCESS(TMR5L,2)
// TMR7L<CAL27>
extern volatile __bit                   CAL27               __at(0x7972);	// @ (0xF2E * 8 + 2)
#define                                 CAL27_bit           _BIT_ACCESS(TMR7L,2)
// TMR1L<CAL31>
extern volatile __bit                   CAL31               __at(0x7E6B);	// @ (0xFCD * 8 + 3)
#define                                 CAL31_bit           _BIT_ACCESS(TMR1L,3)
// TMR3L<CAL33>
extern volatile __bit                   CAL33               __at(0x7E3B);	// @ (0xFC7 * 8 + 3)
#define                                 CAL33_bit           _BIT_ACCESS(TMR3L,3)
// TMR5L<CAL35>
extern volatile __bit                   CAL35               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 CAL35_bit           _BIT_ACCESS(TMR5L,3)
// TMR7L<CAL37>
extern volatile __bit                   CAL37               __at(0x7973);	// @ (0xF2E * 8 + 3)
#define                                 CAL37_bit           _BIT_ACCESS(TMR7L,3)
// TMR1L<CAL41>
extern volatile __bit                   CAL41               __at(0x7E6C);	// @ (0xFCD * 8 + 4)
#define                                 CAL41_bit           _BIT_ACCESS(TMR1L,4)
// TMR3L<CAL43>
extern volatile __bit                   CAL43               __at(0x7E3C);	// @ (0xFC7 * 8 + 4)
#define                                 CAL43_bit           _BIT_ACCESS(TMR3L,4)
// TMR5L<CAL45>
extern volatile __bit                   CAL45               __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 CAL45_bit           _BIT_ACCESS(TMR5L,4)
// TMR7L<CAL47>
extern volatile __bit                   CAL47               __at(0x7974);	// @ (0xF2E * 8 + 4)
#define                                 CAL47_bit           _BIT_ACCESS(TMR7L,4)
// TMR1L<CAL51>
extern volatile __bit                   CAL51               __at(0x7E6D);	// @ (0xFCD * 8 + 5)
#define                                 CAL51_bit           _BIT_ACCESS(TMR1L,5)
// TMR3L<CAL53>
extern volatile __bit                   CAL53               __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 CAL53_bit           _BIT_ACCESS(TMR3L,5)
// TMR5L<CAL55>
extern volatile __bit                   CAL55               __at(0x7E0D);	// @ (0xFC1 * 8 + 5)
#define                                 CAL55_bit           _BIT_ACCESS(TMR5L,5)
// TMR7L<CAL57>
extern volatile __bit                   CAL57               __at(0x7975);	// @ (0xF2E * 8 + 5)
#define                                 CAL57_bit           _BIT_ACCESS(TMR7L,5)
// TMR1L<CAL61>
extern volatile __bit                   CAL61               __at(0x7E6E);	// @ (0xFCD * 8 + 6)
#define                                 CAL61_bit           _BIT_ACCESS(TMR1L,6)
// TMR3L<CAL63>
extern volatile __bit                   CAL63               __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CAL63_bit           _BIT_ACCESS(TMR3L,6)
// TMR5L<CAL65>
extern volatile __bit                   CAL65               __at(0x7E0E);	// @ (0xFC1 * 8 + 6)
#define                                 CAL65_bit           _BIT_ACCESS(TMR5L,6)
// TMR7L<CAL67>
extern volatile __bit                   CAL67               __at(0x7976);	// @ (0xF2E * 8 + 6)
#define                                 CAL67_bit           _BIT_ACCESS(TMR7L,6)
// TMR1L<CAL71>
extern volatile __bit                   CAL71               __at(0x7E6F);	// @ (0xFCD * 8 + 7)
#define                                 CAL71_bit           _BIT_ACCESS(TMR1L,7)
// TMR3L<CAL73>
extern volatile __bit                   CAL73               __at(0x7E3F);	// @ (0xFC7 * 8 + 7)
#define                                 CAL73_bit           _BIT_ACCESS(TMR3L,7)
// TMR5L<CAL75>
extern volatile __bit                   CAL75               __at(0x7E0F);	// @ (0xFC1 * 8 + 7)
#define                                 CAL75_bit           _BIT_ACCESS(TMR5L,7)
// TMR7L<CAL77>
extern volatile __bit                   CAL77               __at(0x7977);	// @ (0xF2E * 8 + 7)
#define                                 CAL77_bit           _BIT_ACCESS(TMR7L,7)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x7EC0);	// @ (0xFD8 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// IPR5<CCH05>
extern volatile __bit                   CCH05               __at(0x7120);	// @ (0xE24 * 8 + 0)
#define                                 CCH05_bit           _BIT_ACCESS(IPR5,0)
// IPR5<CCH15>
extern volatile __bit                   CCH15               __at(0x7121);	// @ (0xE24 * 8 + 1)
#define                                 CCH15_bit           _BIT_ACCESS(IPR5,1)
// IPR4<CCIP3IP>
extern volatile __bit                   CCIP3IP             __at(0x7118);	// @ (0xE23 * 8 + 0)
#define                                 CCIP3IP_bit         _BIT_ACCESS(IPR4,0)
// PORTE<CCP10>
extern volatile __bit                   CCP10               __at(0x7C6A);	// @ (0xF8D * 8 + 2)
#define                                 CCP10_bit           _BIT_ACCESS(PORTE,2)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0x7D61);	// @ (0xFAC * 8 + 1)
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x7D5F);	// @ (0xFAB * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x7D5C);	// @ (0xFAB * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE7<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x7180);	// @ (0xE30 * 8 + 0)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE7,0)
// PIR7<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x71D0);	// @ (0xE3A * 8 + 0)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR7,0)
// IPR7<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x7130);	// @ (0xE26 * 8 + 0)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR7,0)
// PMD4<CCP1MD>
extern volatile __bit                   CCP1MD              __at(0x7280);	// @ (0xE50 * 8 + 0)
#define                                 CCP1MD_bit          _BIT_ACCESS(PMD4,0)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x7D58);	// @ (0xFAB * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x7D59);	// @ (0xFAB * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x7D5A);	// @ (0xFAB * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x7D5B);	// @ (0xFAB * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x7D5D);	// @ (0xFAB * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP1PPS<CCP1PPS0>
extern volatile __bit                   CCP1PPS0            __at(0x7010);	// @ (0xE02 * 8 + 0)
#define                                 CCP1PPS0_bit        _BIT_ACCESS(CCP1PPS,0)
// CCP1PPS<CCP1PPS1>
extern volatile __bit                   CCP1PPS1            __at(0x7011);	// @ (0xE02 * 8 + 1)
#define                                 CCP1PPS1_bit        _BIT_ACCESS(CCP1PPS,1)
// CCP1PPS<CCP1PPS2>
extern volatile __bit                   CCP1PPS2            __at(0x7012);	// @ (0xE02 * 8 + 2)
#define                                 CCP1PPS2_bit        _BIT_ACCESS(CCP1PPS,2)
// CCP1PPS<CCP1PPS3>
extern volatile __bit                   CCP1PPS3            __at(0x7013);	// @ (0xE02 * 8 + 3)
#define                                 CCP1PPS3_bit        _BIT_ACCESS(CCP1PPS,3)
// CCP1PPS<CCP1PPS4>
extern volatile __bit                   CCP1PPS4            __at(0x7014);	// @ (0xE02 * 8 + 4)
#define                                 CCP1PPS4_bit        _BIT_ACCESS(CCP1PPS,4)
// CCP1PPS<CCP1PPS5>
extern volatile __bit                   CCP1PPS5            __at(0x7015);	// @ (0xE02 * 8 + 5)
#define                                 CCP1PPS5_bit        _BIT_ACCESS(CCP1PPS,5)
// PORTC<CCP2>
extern volatile __bit                   CCP2                __at(0x7C59);	// @ (0xF8B * 8 + 1)
#define                                 CCP2_bit            _BIT_ACCESS(PORTC,1)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x7D40);	// @ (0xFA8 * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x7D41);	// @ (0xFA8 * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// PORTE<CCP2E>
extern volatile __bit                   CCP2E               __at(0x7C6F);	// @ (0xF8D * 8 + 7)
#define                                 CCP2E_bit           _BIT_ACCESS(PORTE,7)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x7D3F);	// @ (0xFA7 * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x7D3C);	// @ (0xFA7 * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE7<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x7181);	// @ (0xE30 * 8 + 1)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE7,1)
// PIR7<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x71D1);	// @ (0xE3A * 8 + 1)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR7,1)
// IPR7<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x7131);	// @ (0xE26 * 8 + 1)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR7,1)
// PMD4<CCP2MD>
extern volatile __bit                   CCP2MD              __at(0x7281);	// @ (0xE50 * 8 + 1)
#define                                 CCP2MD_bit          _BIT_ACCESS(PMD4,1)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x7D38);	// @ (0xFA7 * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x7D39);	// @ (0xFA7 * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x7D3A);	// @ (0xFA7 * 8 + 2)
