MikroElektronika/core_packages/PIC/XC8/def/PIC18LF66K40/mcu.h
extern volatile __bit                   IOCEF0              __at(0x7540);	// @ (0xEA8 * 8 + 0)
#define                                 IOCEF0_bit          _BIT_ACCESS(IOCEF,0)
// IOCEF<IOCEF1>
extern volatile __bit                   IOCEF1              __at(0x7541);	// @ (0xEA8 * 8 + 1)
#define                                 IOCEF1_bit          _BIT_ACCESS(IOCEF,1)
// IOCEF<IOCEF2>
extern volatile __bit                   IOCEF2              __at(0x7542);	// @ (0xEA8 * 8 + 2)
#define                                 IOCEF2_bit          _BIT_ACCESS(IOCEF,2)
// IOCEF<IOCEF3>
extern volatile __bit                   IOCEF3              __at(0x7543);	// @ (0xEA8 * 8 + 3)
#define                                 IOCEF3_bit          _BIT_ACCESS(IOCEF,3)
// IOCEF<IOCEF4>
extern volatile __bit                   IOCEF4              __at(0x7544);	// @ (0xEA8 * 8 + 4)
#define                                 IOCEF4_bit          _BIT_ACCESS(IOCEF,4)
// IOCEF<IOCEF5>
extern volatile __bit                   IOCEF5              __at(0x7545);	// @ (0xEA8 * 8 + 5)
#define                                 IOCEF5_bit          _BIT_ACCESS(IOCEF,5)
// IOCEF<IOCEF6>
extern volatile __bit                   IOCEF6              __at(0x7546);	// @ (0xEA8 * 8 + 6)
#define                                 IOCEF6_bit          _BIT_ACCESS(IOCEF,6)
// IOCEF<IOCEF7>
extern volatile __bit                   IOCEF7              __at(0x7547);	// @ (0xEA8 * 8 + 7)
#define                                 IOCEF7_bit          _BIT_ACCESS(IOCEF,7)
// IOCEN<IOCEN0>
extern volatile __bit                   IOCEN0              __at(0x7548);	// @ (0xEA9 * 8 + 0)
#define                                 IOCEN0_bit          _BIT_ACCESS(IOCEN,0)
// IOCEN<IOCEN1>
extern volatile __bit                   IOCEN1              __at(0x7549);	// @ (0xEA9 * 8 + 1)
#define                                 IOCEN1_bit          _BIT_ACCESS(IOCEN,1)
// IOCEN<IOCEN2>
extern volatile __bit                   IOCEN2              __at(0x754A);	// @ (0xEA9 * 8 + 2)
#define                                 IOCEN2_bit          _BIT_ACCESS(IOCEN,2)
// IOCEN<IOCEN3>
extern volatile __bit                   IOCEN3              __at(0x754B);	// @ (0xEA9 * 8 + 3)
#define                                 IOCEN3_bit          _BIT_ACCESS(IOCEN,3)
// IOCEN<IOCEN4>
extern volatile __bit                   IOCEN4              __at(0x754C);	// @ (0xEA9 * 8 + 4)
#define                                 IOCEN4_bit          _BIT_ACCESS(IOCEN,4)
// IOCEN<IOCEN5>
extern volatile __bit                   IOCEN5              __at(0x754D);	// @ (0xEA9 * 8 + 5)
#define                                 IOCEN5_bit          _BIT_ACCESS(IOCEN,5)
// IOCEN<IOCEN6>
extern volatile __bit                   IOCEN6              __at(0x754E);	// @ (0xEA9 * 8 + 6)
#define                                 IOCEN6_bit          _BIT_ACCESS(IOCEN,6)
// IOCEN<IOCEN7>
extern volatile __bit                   IOCEN7              __at(0x754F);	// @ (0xEA9 * 8 + 7)
#define                                 IOCEN7_bit          _BIT_ACCESS(IOCEN,7)
// IOCEP<IOCEP0>
extern volatile __bit                   IOCEP0              __at(0x7550);	// @ (0xEAA * 8 + 0)
#define                                 IOCEP0_bit          _BIT_ACCESS(IOCEP,0)
// IOCEP<IOCEP1>
extern volatile __bit                   IOCEP1              __at(0x7551);	// @ (0xEAA * 8 + 1)
#define                                 IOCEP1_bit          _BIT_ACCESS(IOCEP,1)
// IOCEP<IOCEP2>
extern volatile __bit                   IOCEP2              __at(0x7552);	// @ (0xEAA * 8 + 2)
#define                                 IOCEP2_bit          _BIT_ACCESS(IOCEP,2)
// IOCEP<IOCEP3>
extern volatile __bit                   IOCEP3              __at(0x7553);	// @ (0xEAA * 8 + 3)
#define                                 IOCEP3_bit          _BIT_ACCESS(IOCEP,3)
// IOCEP<IOCEP4>
extern volatile __bit                   IOCEP4              __at(0x7554);	// @ (0xEAA * 8 + 4)
#define                                 IOCEP4_bit          _BIT_ACCESS(IOCEP,4)
// IOCEP<IOCEP5>
extern volatile __bit                   IOCEP5              __at(0x7555);	// @ (0xEAA * 8 + 5)
#define                                 IOCEP5_bit          _BIT_ACCESS(IOCEP,5)
// IOCEP<IOCEP6>
extern volatile __bit                   IOCEP6              __at(0x7556);	// @ (0xEAA * 8 + 6)
#define                                 IOCEP6_bit          _BIT_ACCESS(IOCEP,6)
// IOCEP<IOCEP7>
extern volatile __bit                   IOCEP7              __at(0x7557);	// @ (0xEAA * 8 + 7)
#define                                 IOCEP7_bit          _BIT_ACCESS(IOCEP,7)
// IOCGF<IOCGF5>
extern volatile __bit                   IOCGF5              __at(0x75AD);	// @ (0xEB5 * 8 + 5)
#define                                 IOCGF5_bit          _BIT_ACCESS(IOCGF,5)
// IOCGN<IOCGN5>
extern volatile __bit                   IOCGN5              __at(0x75B5);	// @ (0xEB6 * 8 + 5)
#define                                 IOCGN5_bit          _BIT_ACCESS(IOCGN,5)
// IOCGP<IOCGP5>
extern volatile __bit                   IOCGP5              __at(0x75BD);	// @ (0xEB7 * 8 + 5)
#define                                 IOCGP5_bit          _BIT_ACCESS(IOCGP,5)
// PIE0<IOCIE>
extern volatile __bit                   IOCIE               __at(0x714C);	// @ (0xE29 * 8 + 4)
#define                                 IOCIE_bit           _BIT_ACCESS(PIE0,4)
// PIR0<IOCIF>
extern volatile __bit                   IOCIF               __at(0x719C);	// @ (0xE33 * 8 + 4)
#define                                 IOCIF_bit           _BIT_ACCESS(PIR0,4)
// IPR0<IOCIP>
extern volatile __bit                   IOCIP               __at(0x70FC);	// @ (0xE1F * 8 + 4)
#define                                 IOCIP_bit           _BIT_ACCESS(IPR0,4)
// PMD0<IOCMD>
extern volatile __bit                   IOCMD               __at(0x7260);	// @ (0xE4C * 8 + 0)
#define                                 IOCMD_bit           _BIT_ACCESS(PMD0,0)
// INTCON<IPEN>
extern volatile __bit                   IPEN                __at(0x7F95);	// @ (0xFF2 * 8 + 5)
#define                                 IPEN_bit            _BIT_ACCESS(INTCON,5)
// LATA<LA0>
extern volatile __bit                   LA0                 __at(0x7BC8);	// @ (0xF79 * 8 + 0)
#define                                 LA0_bit             _BIT_ACCESS(LATA,0)
// LATA<LA1>
extern volatile __bit                   LA1                 __at(0x7BC9);	// @ (0xF79 * 8 + 1)
#define                                 LA1_bit             _BIT_ACCESS(LATA,1)
// LATA<LA2>
extern volatile __bit                   LA2                 __at(0x7BCA);	// @ (0xF79 * 8 + 2)
#define                                 LA2_bit             _BIT_ACCESS(LATA,2)
// LATA<LA3>
extern volatile __bit                   LA3                 __at(0x7BCB);	// @ (0xF79 * 8 + 3)
#define                                 LA3_bit             _BIT_ACCESS(LATA,3)
// LATA<LA4>
extern volatile __bit                   LA4                 __at(0x7BCC);	// @ (0xF79 * 8 + 4)
#define                                 LA4_bit             _BIT_ACCESS(LATA,4)
// LATA<LA5>
extern volatile __bit                   LA5                 __at(0x7BCD);	// @ (0xF79 * 8 + 5)
#define                                 LA5_bit             _BIT_ACCESS(LATA,5)
// LATA<LA6>
extern volatile __bit                   LA6                 __at(0x7BCE);	// @ (0xF79 * 8 + 6)
#define                                 LA6_bit             _BIT_ACCESS(LATA,6)
// LATA<LA7>
extern volatile __bit                   LA7                 __at(0x7BCF);	// @ (0xF79 * 8 + 7)
#define                                 LA7_bit             _BIT_ACCESS(LATA,7)
// SCANLADRL<LADR0>
extern volatile __bit                   LADR0               __at(0x7A48);	// @ (0xF49 * 8 + 0)
#define                                 LADR0_bit           _BIT_ACCESS(SCANLADRL,0)
// SCANLADRL<LADR1>
extern volatile __bit                   LADR1               __at(0x7A49);	// @ (0xF49 * 8 + 1)
#define                                 LADR1_bit           _BIT_ACCESS(SCANLADRL,1)
// SCANLADRH<LADR10>
extern volatile __bit                   LADR10              __at(0x7A52);	// @ (0xF4A * 8 + 2)
#define                                 LADR10_bit          _BIT_ACCESS(SCANLADRH,2)
// SCANLADRH<LADR11>
extern volatile __bit                   LADR11              __at(0x7A53);	// @ (0xF4A * 8 + 3)
#define                                 LADR11_bit          _BIT_ACCESS(SCANLADRH,3)
// SCANLADRH<LADR12>
extern volatile __bit                   LADR12              __at(0x7A54);	// @ (0xF4A * 8 + 4)
#define                                 LADR12_bit          _BIT_ACCESS(SCANLADRH,4)
// SCANLADRH<LADR13>
extern volatile __bit                   LADR13              __at(0x7A55);	// @ (0xF4A * 8 + 5)
#define                                 LADR13_bit          _BIT_ACCESS(SCANLADRH,5)
// SCANLADRH<LADR14>
extern volatile __bit                   LADR14              __at(0x7A56);	// @ (0xF4A * 8 + 6)
#define                                 LADR14_bit          _BIT_ACCESS(SCANLADRH,6)
// SCANLADRH<LADR15>
extern volatile __bit                   LADR15              __at(0x7A57);	// @ (0xF4A * 8 + 7)
#define                                 LADR15_bit          _BIT_ACCESS(SCANLADRH,7)
// SCANLADRU<LADR16>
extern volatile __bit                   LADR16              __at(0x7A58);	// @ (0xF4B * 8 + 0)
#define                                 LADR16_bit          _BIT_ACCESS(SCANLADRU,0)
// SCANLADRU<LADR17>
extern volatile __bit                   LADR17              __at(0x7A59);	// @ (0xF4B * 8 + 1)
#define                                 LADR17_bit          _BIT_ACCESS(SCANLADRU,1)
// SCANLADRU<LADR18>
extern volatile __bit                   LADR18              __at(0x7A5A);	// @ (0xF4B * 8 + 2)
#define                                 LADR18_bit          _BIT_ACCESS(SCANLADRU,2)
// SCANLADRU<LADR19>
extern volatile __bit                   LADR19              __at(0x7A5B);	// @ (0xF4B * 8 + 3)
#define                                 LADR19_bit          _BIT_ACCESS(SCANLADRU,3)
// SCANLADRL<LADR2>
extern volatile __bit                   LADR2               __at(0x7A4A);	// @ (0xF49 * 8 + 2)
#define                                 LADR2_bit           _BIT_ACCESS(SCANLADRL,2)
// SCANLADRU<LADR20>
extern volatile __bit                   LADR20              __at(0x7A5C);	// @ (0xF4B * 8 + 4)
#define                                 LADR20_bit          _BIT_ACCESS(SCANLADRU,4)
// SCANLADRU<LADR21>
extern volatile __bit                   LADR21              __at(0x7A5D);	// @ (0xF4B * 8 + 5)
#define                                 LADR21_bit          _BIT_ACCESS(SCANLADRU,5)
// SCANLADRL<LADR3>
extern volatile __bit                   LADR3               __at(0x7A4B);	// @ (0xF49 * 8 + 3)
#define                                 LADR3_bit           _BIT_ACCESS(SCANLADRL,3)
// SCANLADRL<LADR4>
extern volatile __bit                   LADR4               __at(0x7A4C);	// @ (0xF49 * 8 + 4)
#define                                 LADR4_bit           _BIT_ACCESS(SCANLADRL,4)
// SCANLADRL<LADR5>
extern volatile __bit                   LADR5               __at(0x7A4D);	// @ (0xF49 * 8 + 5)
#define                                 LADR5_bit           _BIT_ACCESS(SCANLADRL,5)
// SCANLADRL<LADR6>
extern volatile __bit                   LADR6               __at(0x7A4E);	// @ (0xF49 * 8 + 6)
#define                                 LADR6_bit           _BIT_ACCESS(SCANLADRL,6)
// SCANLADRL<LADR7>
extern volatile __bit                   LADR7               __at(0x7A4F);	// @ (0xF49 * 8 + 7)
#define                                 LADR7_bit           _BIT_ACCESS(SCANLADRL,7)
// SCANLADRH<LADR8>
extern volatile __bit                   LADR8               __at(0x7A50);	// @ (0xF4A * 8 + 0)
#define                                 LADR8_bit           _BIT_ACCESS(SCANLADRH,0)
// SCANLADRH<LADR9>
extern volatile __bit                   LADR9               __at(0x7A51);	// @ (0xF4A * 8 + 1)
#define                                 LADR9_bit           _BIT_ACCESS(SCANLADRH,1)
// LATA<LATA0>
extern volatile __bit                   LATA0               __at(0x7BC8);	// @ (0xF79 * 8 + 0)
#define                                 LATA0_bit           _BIT_ACCESS(LATA,0)
// LATA<LATA1>
extern volatile __bit                   LATA1               __at(0x7BC9);	// @ (0xF79 * 8 + 1)
#define                                 LATA1_bit           _BIT_ACCESS(LATA,1)
// LATA<LATA2>
extern volatile __bit                   LATA2               __at(0x7BCA);	// @ (0xF79 * 8 + 2)
#define                                 LATA2_bit           _BIT_ACCESS(LATA,2)
// LATA<LATA3>
extern volatile __bit                   LATA3               __at(0x7BCB);	// @ (0xF79 * 8 + 3)
#define                                 LATA3_bit           _BIT_ACCESS(LATA,3)
// LATA<LATA4>
extern volatile __bit                   LATA4               __at(0x7BCC);	// @ (0xF79 * 8 + 4)
#define                                 LATA4_bit           _BIT_ACCESS(LATA,4)
// LATA<LATA5>
extern volatile __bit                   LATA5               __at(0x7BCD);	// @ (0xF79 * 8 + 5)
#define                                 LATA5_bit           _BIT_ACCESS(LATA,5)
// LATA<LATA6>
extern volatile __bit                   LATA6               __at(0x7BCE);	// @ (0xF79 * 8 + 6)
#define                                 LATA6_bit           _BIT_ACCESS(LATA,6)
// LATA<LATA7>
extern volatile __bit                   LATA7               __at(0x7BCF);	// @ (0xF79 * 8 + 7)
#define                                 LATA7_bit           _BIT_ACCESS(LATA,7)
// LATB<LATB0>
extern volatile __bit                   LATB0               __at(0x7BD0);	// @ (0xF7A * 8 + 0)
#define                                 LATB0_bit           _BIT_ACCESS(LATB,0)
// LATB<LATB1>
extern volatile __bit                   LATB1               __at(0x7BD1);	// @ (0xF7A * 8 + 1)
#define                                 LATB1_bit           _BIT_ACCESS(LATB,1)
// LATB<LATB2>
extern volatile __bit                   LATB2               __at(0x7BD2);	// @ (0xF7A * 8 + 2)
#define                                 LATB2_bit           _BIT_ACCESS(LATB,2)
// LATB<LATB3>
extern volatile __bit                   LATB3               __at(0x7BD3);	// @ (0xF7A * 8 + 3)
#define                                 LATB3_bit           _BIT_ACCESS(LATB,3)
// LATB<LATB4>
extern volatile __bit                   LATB4               __at(0x7BD4);	// @ (0xF7A * 8 + 4)
#define                                 LATB4_bit           _BIT_ACCESS(LATB,4)
// LATB<LATB5>
extern volatile __bit                   LATB5               __at(0x7BD5);	// @ (0xF7A * 8 + 5)
#define                                 LATB5_bit           _BIT_ACCESS(LATB,5)
// LATB<LATB6>
extern volatile __bit                   LATB6               __at(0x7BD6);	// @ (0xF7A * 8 + 6)
#define                                 LATB6_bit           _BIT_ACCESS(LATB,6)
// LATB<LATB7>
extern volatile __bit                   LATB7               __at(0x7BD7);	// @ (0xF7A * 8 + 7)
#define                                 LATB7_bit           _BIT_ACCESS(LATB,7)
// LATC<LATC0>
extern volatile __bit                   LATC0               __at(0x7BD8);	// @ (0xF7B * 8 + 0)
#define                                 LATC0_bit           _BIT_ACCESS(LATC,0)
// LATC<LATC1>
extern volatile __bit                   LATC1               __at(0x7BD9);	// @ (0xF7B * 8 + 1)
#define                                 LATC1_bit           _BIT_ACCESS(LATC,1)
// LATC<LATC2>
extern volatile __bit                   LATC2               __at(0x7BDA);	// @ (0xF7B * 8 + 2)
#define                                 LATC2_bit           _BIT_ACCESS(LATC,2)
// LATC<LATC3>
extern volatile __bit                   LATC3               __at(0x7BDB);	// @ (0xF7B * 8 + 3)
#define                                 LATC3_bit           _BIT_ACCESS(LATC,3)
// LATC<LATC4>
extern volatile __bit                   LATC4               __at(0x7BDC);	// @ (0xF7B * 8 + 4)
#define                                 LATC4_bit           _BIT_ACCESS(LATC,4)
// LATC<LATC5>
extern volatile __bit                   LATC5               __at(0x7BDD);	// @ (0xF7B * 8 + 5)
#define                                 LATC5_bit           _BIT_ACCESS(LATC,5)
// LATC<LATC6>
extern volatile __bit                   LATC6               __at(0x7BDE);	// @ (0xF7B * 8 + 6)
#define                                 LATC6_bit           _BIT_ACCESS(LATC,6)
// LATC<LATC7>
extern volatile __bit                   LATC7               __at(0x7BDF);	// @ (0xF7B * 8 + 7)
#define                                 LATC7_bit           _BIT_ACCESS(LATC,7)
// LATD<LATD0>
extern volatile __bit                   LATD0               __at(0x7BE0);	// @ (0xF7C * 8 + 0)
#define                                 LATD0_bit           _BIT_ACCESS(LATD,0)
// LATD<LATD1>
extern volatile __bit                   LATD1               __at(0x7BE1);	// @ (0xF7C * 8 + 1)
#define                                 LATD1_bit           _BIT_ACCESS(LATD,1)
// LATD<LATD2>
extern volatile __bit                   LATD2               __at(0x7BE2);	// @ (0xF7C * 8 + 2)
#define                                 LATD2_bit           _BIT_ACCESS(LATD,2)
// LATD<LATD3>
extern volatile __bit                   LATD3               __at(0x7BE3);	// @ (0xF7C * 8 + 3)
#define                                 LATD3_bit           _BIT_ACCESS(LATD,3)
// LATD<LATD4>
extern volatile __bit                   LATD4               __at(0x7BE4);	// @ (0xF7C * 8 + 4)
#define                                 LATD4_bit           _BIT_ACCESS(LATD,4)
// LATD<LATD5>
extern volatile __bit                   LATD5               __at(0x7BE5);	// @ (0xF7C * 8 + 5)
#define                                 LATD5_bit           _BIT_ACCESS(LATD,5)
// LATD<LATD6>
extern volatile __bit                   LATD6               __at(0x7BE6);	// @ (0xF7C * 8 + 6)
#define                                 LATD6_bit           _BIT_ACCESS(LATD,6)
// LATD<LATD7>
extern volatile __bit                   LATD7               __at(0x7BE7);	// @ (0xF7C * 8 + 7)
#define                                 LATD7_bit           _BIT_ACCESS(LATD,7)
// LATE<LATE0>
extern volatile __bit                   LATE0               __at(0x7BE8);	// @ (0xF7D * 8 + 0)
#define                                 LATE0_bit           _BIT_ACCESS(LATE,0)
// LATE<LATE1>
extern volatile __bit                   LATE1               __at(0x7BE9);	// @ (0xF7D * 8 + 1)
#define                                 LATE1_bit           _BIT_ACCESS(LATE,1)
// LATE<LATE2>
extern volatile __bit                   LATE2               __at(0x7BEA);	// @ (0xF7D * 8 + 2)
#define                                 LATE2_bit           _BIT_ACCESS(LATE,2)
// LATE<LATE3>
extern volatile __bit                   LATE3               __at(0x7BEB);	// @ (0xF7D * 8 + 3)
#define                                 LATE3_bit           _BIT_ACCESS(LATE,3)
// LATE<LATE4>
extern volatile __bit                   LATE4               __at(0x7BEC);	// @ (0xF7D * 8 + 4)
#define                                 LATE4_bit           _BIT_ACCESS(LATE,4)
// LATE<LATE5>
extern volatile __bit                   LATE5               __at(0x7BED);	// @ (0xF7D * 8 + 5)
#define                                 LATE5_bit           _BIT_ACCESS(LATE,5)
// LATE<LATE6>
extern volatile __bit                   LATE6               __at(0x7BEE);	// @ (0xF7D * 8 + 6)
#define                                 LATE6_bit           _BIT_ACCESS(LATE,6)
// LATE<LATE7>
extern volatile __bit                   LATE7               __at(0x7BEF);	// @ (0xF7D * 8 + 7)
#define                                 LATE7_bit           _BIT_ACCESS(LATE,7)
// LATF<LATF0>
extern volatile __bit                   LATF0               __at(0x7BF0);	// @ (0xF7E * 8 + 0)
#define                                 LATF0_bit           _BIT_ACCESS(LATF,0)
// LATF<LATF1>
extern volatile __bit                   LATF1               __at(0x7BF1);	// @ (0xF7E * 8 + 1)
#define                                 LATF1_bit           _BIT_ACCESS(LATF,1)
// LATF<LATF2>
extern volatile __bit                   LATF2               __at(0x7BF2);	// @ (0xF7E * 8 + 2)
#define                                 LATF2_bit           _BIT_ACCESS(LATF,2)
// LATF<LATF3>
extern volatile __bit                   LATF3               __at(0x7BF3);	// @ (0xF7E * 8 + 3)
#define                                 LATF3_bit           _BIT_ACCESS(LATF,3)
// LATF<LATF4>
extern volatile __bit                   LATF4               __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 LATF4_bit           _BIT_ACCESS(LATF,4)
// LATF<LATF5>
extern volatile __bit                   LATF5               __at(0x7BF5);	// @ (0xF7E * 8 + 5)
#define                                 LATF5_bit           _BIT_ACCESS(LATF,5)
// LATF<LATF6>
extern volatile __bit                   LATF6               __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 LATF6_bit           _BIT_ACCESS(LATF,6)
// LATF<LATF7>
extern volatile __bit                   LATF7               __at(0x7BF7);	// @ (0xF7E * 8 + 7)
#define                                 LATF7_bit           _BIT_ACCESS(LATF,7)
// LATG<LATG0>
extern volatile __bit                   LATG0               __at(0x7BF8);	// @ (0xF7F * 8 + 0)
#define                                 LATG0_bit           _BIT_ACCESS(LATG,0)
// LATG<LATG1>
extern volatile __bit                   LATG1               __at(0x7BF9);	// @ (0xF7F * 8 + 1)
#define                                 LATG1_bit           _BIT_ACCESS(LATG,1)
// LATG<LATG2>
extern volatile __bit                   LATG2               __at(0x7BFA);	// @ (0xF7F * 8 + 2)
#define                                 LATG2_bit           _BIT_ACCESS(LATG,2)
// LATG<LATG3>
extern volatile __bit                   LATG3               __at(0x7BFB);	// @ (0xF7F * 8 + 3)
#define                                 LATG3_bit           _BIT_ACCESS(LATG,3)
// LATG<LATG4>
extern volatile __bit                   LATG4               __at(0x7BFC);	// @ (0xF7F * 8 + 4)
#define                                 LATG4_bit           _BIT_ACCESS(LATG,4)
// LATG<LATG6>
extern volatile __bit                   LATG6               __at(0x7BFE);	// @ (0xF7F * 8 + 6)
#define                                 LATG6_bit           _BIT_ACCESS(LATG,6)
// LATG<LATG7>
extern volatile __bit                   LATG7               __at(0x7BFF);	// @ (0xF7F * 8 + 7)
#define                                 LATG7_bit           _BIT_ACCESS(LATG,7)
// LATH<LATH0>
extern volatile __bit                   LATH0               __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 LATH0_bit           _BIT_ACCESS(LATH,0)
// LATH<LATH1>
extern volatile __bit                   LATH1               __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 LATH1_bit           _BIT_ACCESS(LATH,1)
// LATH<LATH2>
extern volatile __bit                   LATH2               __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 LATH2_bit           _BIT_ACCESS(LATH,2)
// LATH<LATH3>
extern volatile __bit                   LATH3               __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 LATH3_bit           _BIT_ACCESS(LATH,3)
// LATB<LB0>
extern volatile __bit                   LB0                 __at(0x7BD0);	// @ (0xF7A * 8 + 0)
#define                                 LB0_bit             _BIT_ACCESS(LATB,0)
// LATB<LB1>
extern volatile __bit                   LB1                 __at(0x7BD1);	// @ (0xF7A * 8 + 1)
#define                                 LB1_bit             _BIT_ACCESS(LATB,1)
// LATB<LB2>
extern volatile __bit                   LB2                 __at(0x7BD2);	// @ (0xF7A * 8 + 2)
#define                                 LB2_bit             _BIT_ACCESS(LATB,2)
// LATB<LB3>
extern volatile __bit                   LB3                 __at(0x7BD3);	// @ (0xF7A * 8 + 3)
