MikroElektronika/core_packages/PIC/XC8/def/PIC18LF66K40/mcu.h
#define                                 T3GSS3_bit          _BIT_ACCESS(T3GATE,3)
// T3GCON<T3GTM>
extern volatile __bit                   T3GTM               __at(0x7E55);	// @ (0xFCA * 8 + 5)
#define                                 T3GTM_bit           _BIT_ACCESS(T3GCON,5)
// T3GCON<T3GVAL>
extern volatile __bit                   T3GVAL              __at(0x7E52);	// @ (0xFCA * 8 + 2)
#define                                 T3GVAL_bit          _BIT_ACCESS(T3GCON,2)
// T3CON<T3RD16>
extern volatile __bit                   T3RD16              __at(0x7E49);	// @ (0xFC9 * 8 + 1)
#define                                 T3RD16_bit          _BIT_ACCESS(T3CON,1)
// T4HLT<T4CKPOL>
extern volatile __bit                   T4CKPOL             __at(0x7DC6);	// @ (0xFB8 * 8 + 6)
#define                                 T4CKPOL_bit         _BIT_ACCESS(T4HLT,6)
// T4CON<T4CKPS0>
extern volatile __bit                   T4CKPS0             __at(0x7DBC);	// @ (0xFB7 * 8 + 4)
#define                                 T4CKPS0_bit         _BIT_ACCESS(T4CON,4)
// T4CON<T4CKPS1>
extern volatile __bit                   T4CKPS1             __at(0x7DBD);	// @ (0xFB7 * 8 + 5)
#define                                 T4CKPS1_bit         _BIT_ACCESS(T4CON,5)
// T4CON<T4CKPS2>
extern volatile __bit                   T4CKPS2             __at(0x7DBE);	// @ (0xFB7 * 8 + 6)
#define                                 T4CKPS2_bit         _BIT_ACCESS(T4CON,6)
// T4HLT<T4CKSYNC>
extern volatile __bit                   T4CKSYNC            __at(0x7DC5);	// @ (0xFB8 * 8 + 5)
#define                                 T4CKSYNC_bit        _BIT_ACCESS(T4HLT,5)
// T4CLKCON<T4CS0>
extern volatile __bit                   T4CS0               __at(0x7DC8);	// @ (0xFB9 * 8 + 0)
#define                                 T4CS0_bit           _BIT_ACCESS(T4CLKCON,0)
// T4CLKCON<T4CS1>
extern volatile __bit                   T4CS1               __at(0x7DC9);	// @ (0xFB9 * 8 + 1)
#define                                 T4CS1_bit           _BIT_ACCESS(T4CLKCON,1)
// T4CLKCON<T4CS2>
extern volatile __bit                   T4CS2               __at(0x7DCA);	// @ (0xFB9 * 8 + 2)
#define                                 T4CS2_bit           _BIT_ACCESS(T4CLKCON,2)
// T4CLKCON<T4CS3>
extern volatile __bit                   T4CS3               __at(0x7DCB);	// @ (0xFB9 * 8 + 3)
#define                                 T4CS3_bit           _BIT_ACCESS(T4CLKCON,3)
// T4INPPS<T4INPPS0>
extern volatile __bit                   T4INPPS0            __at(0x6FF0);	// @ (0xDFE * 8 + 0)
#define                                 T4INPPS0_bit        _BIT_ACCESS(T4INPPS,0)
// T4INPPS<T4INPPS1>
extern volatile __bit                   T4INPPS1            __at(0x6FF1);	// @ (0xDFE * 8 + 1)
#define                                 T4INPPS1_bit        _BIT_ACCESS(T4INPPS,1)
// T4INPPS<T4INPPS2>
extern volatile __bit                   T4INPPS2            __at(0x6FF2);	// @ (0xDFE * 8 + 2)
#define                                 T4INPPS2_bit        _BIT_ACCESS(T4INPPS,2)
// T4INPPS<T4INPPS3>
extern volatile __bit                   T4INPPS3            __at(0x6FF3);	// @ (0xDFE * 8 + 3)
#define                                 T4INPPS3_bit        _BIT_ACCESS(T4INPPS,3)
// T4INPPS<T4INPPS4>
extern volatile __bit                   T4INPPS4            __at(0x6FF4);	// @ (0xDFE * 8 + 4)
#define                                 T4INPPS4_bit        _BIT_ACCESS(T4INPPS,4)
// T4INPPS<T4INPPS5>
extern volatile __bit                   T4INPPS5            __at(0x6FF5);	// @ (0xDFE * 8 + 5)
#define                                 T4INPPS5_bit        _BIT_ACCESS(T4INPPS,5)
// T4HLT<T4MODE0>
extern volatile __bit                   T4MODE0             __at(0x7DC0);	// @ (0xFB8 * 8 + 0)
#define                                 T4MODE0_bit         _BIT_ACCESS(T4HLT,0)
// T4HLT<T4MODE1>
extern volatile __bit                   T4MODE1             __at(0x7DC1);	// @ (0xFB8 * 8 + 1)
#define                                 T4MODE1_bit         _BIT_ACCESS(T4HLT,1)
// T4HLT<T4MODE2>
extern volatile __bit                   T4MODE2             __at(0x7DC2);	// @ (0xFB8 * 8 + 2)
#define                                 T4MODE2_bit         _BIT_ACCESS(T4HLT,2)
// T4HLT<T4MODE3>
extern volatile __bit                   T4MODE3             __at(0x7DC3);	// @ (0xFB8 * 8 + 3)
#define                                 T4MODE3_bit         _BIT_ACCESS(T4HLT,3)
// T4HLT<T4MODE4>
extern volatile __bit                   T4MODE4             __at(0x7DC4);	// @ (0xFB8 * 8 + 4)
#define                                 T4MODE4_bit         _BIT_ACCESS(T4HLT,4)
// T4CON<T4ON>
extern volatile __bit                   T4ON                __at(0x7DBF);	// @ (0xFB7 * 8 + 7)
#define                                 T4ON_bit            _BIT_ACCESS(T4CON,7)
// T4CON<T4OUTPS0>
extern volatile __bit                   T4OUTPS0            __at(0x7DB8);	// @ (0xFB7 * 8 + 0)
#define                                 T4OUTPS0_bit        _BIT_ACCESS(T4CON,0)
// T4CON<T4OUTPS1>
extern volatile __bit                   T4OUTPS1            __at(0x7DB9);	// @ (0xFB7 * 8 + 1)
#define                                 T4OUTPS1_bit        _BIT_ACCESS(T4CON,1)
// T4CON<T4OUTPS2>
extern volatile __bit                   T4OUTPS2            __at(0x7DBA);	// @ (0xFB7 * 8 + 2)
#define                                 T4OUTPS2_bit        _BIT_ACCESS(T4CON,2)
// T4CON<T4OUTPS3>
extern volatile __bit                   T4OUTPS3            __at(0x7DBB);	// @ (0xFB7 * 8 + 3)
#define                                 T4OUTPS3_bit        _BIT_ACCESS(T4CON,3)
// T4HLT<T4PSYNC>
extern volatile __bit                   T4PSYNC             __at(0x7DC7);	// @ (0xFB8 * 8 + 7)
#define                                 T4PSYNC_bit         _BIT_ACCESS(T4HLT,7)
// T4RST<T4RSEL0>
extern volatile __bit                   T4RSEL0             __at(0x7DD0);	// @ (0xFBA * 8 + 0)
#define                                 T4RSEL0_bit         _BIT_ACCESS(T4RST,0)
// T4RST<T4RSEL1>
extern volatile __bit                   T4RSEL1             __at(0x7DD1);	// @ (0xFBA * 8 + 1)
#define                                 T4RSEL1_bit         _BIT_ACCESS(T4RST,1)
// T4RST<T4RSEL2>
extern volatile __bit                   T4RSEL2             __at(0x7DD2);	// @ (0xFBA * 8 + 2)
#define                                 T4RSEL2_bit         _BIT_ACCESS(T4RST,2)
// T4RST<T4RSEL3>
extern volatile __bit                   T4RSEL3             __at(0x7DD3);	// @ (0xFBA * 8 + 3)
#define                                 T4RSEL3_bit         _BIT_ACCESS(T4RST,3)
// T5CKIPPS<T5CKIPPS0>
extern volatile __bit                   T5CKIPPS0           __at(0x6FC8);	// @ (0xDF9 * 8 + 0)
#define                                 T5CKIPPS0_bit       _BIT_ACCESS(T5CKIPPS,0)
// T5CKIPPS<T5CKIPPS1>
extern volatile __bit                   T5CKIPPS1           __at(0x6FC9);	// @ (0xDF9 * 8 + 1)
#define                                 T5CKIPPS1_bit       _BIT_ACCESS(T5CKIPPS,1)
// T5CKIPPS<T5CKIPPS2>
extern volatile __bit                   T5CKIPPS2           __at(0x6FCA);	// @ (0xDF9 * 8 + 2)
#define                                 T5CKIPPS2_bit       _BIT_ACCESS(T5CKIPPS,2)
// T5CKIPPS<T5CKIPPS3>
extern volatile __bit                   T5CKIPPS3           __at(0x6FCB);	// @ (0xDF9 * 8 + 3)
#define                                 T5CKIPPS3_bit       _BIT_ACCESS(T5CKIPPS,3)
// T5CKIPPS<T5CKIPPS4>
extern volatile __bit                   T5CKIPPS4           __at(0x6FCC);	// @ (0xDF9 * 8 + 4)
#define                                 T5CKIPPS4_bit       _BIT_ACCESS(T5CKIPPS,4)
// T5CKIPPS<T5CKIPPS5>
extern volatile __bit                   T5CKIPPS5           __at(0x6FCD);	// @ (0xDF9 * 8 + 5)
#define                                 T5CKIPPS5_bit       _BIT_ACCESS(T5CKIPPS,5)
// T5CON<T5CKPS0>
extern volatile __bit                   T5CKPS0             __at(0x7E1C);	// @ (0xFC3 * 8 + 4)
#define                                 T5CKPS0_bit         _BIT_ACCESS(T5CON,4)
// T5CON<T5CKPS1>
extern volatile __bit                   T5CKPS1             __at(0x7E1D);	// @ (0xFC3 * 8 + 5)
#define                                 T5CKPS1_bit         _BIT_ACCESS(T5CON,5)
// T5CLK<T5CS0>
extern volatile __bit                   T5CS0               __at(0x7E30);	// @ (0xFC6 * 8 + 0)
#define                                 T5CS0_bit           _BIT_ACCESS(T5CLK,0)
// T5CLK<T5CS1>
extern volatile __bit                   T5CS1               __at(0x7E31);	// @ (0xFC6 * 8 + 1)
#define                                 T5CS1_bit           _BIT_ACCESS(T5CLK,1)
// T5CLK<T5CS2>
extern volatile __bit                   T5CS2               __at(0x7E32);	// @ (0xFC6 * 8 + 2)
#define                                 T5CS2_bit           _BIT_ACCESS(T5CLK,2)
// T5CLK<T5CS3>
extern volatile __bit                   T5CS3               __at(0x7E33);	// @ (0xFC6 * 8 + 3)
#define                                 T5CS3_bit           _BIT_ACCESS(T5CLK,3)
// T5GCON<T5GE>
extern volatile __bit                   T5GE                __at(0x7E27);	// @ (0xFC4 * 8 + 7)
#define                                 T5GE_bit            _BIT_ACCESS(T5GCON,7)
// T5GCON<T5GGO>
extern volatile __bit                   T5GGO               __at(0x7E23);	// @ (0xFC4 * 8 + 3)
#define                                 T5GGO_bit           _BIT_ACCESS(T5GCON,3)
// T5GCON<T5GGO_NOT_DONE>
extern volatile __bit                   T5GGO_NOT_DONE      __at(0x7E23);	// @ (0xFC4 * 8 + 3)
#define                                 T5GGO_NOT_DONE_bit  _BIT_ACCESS(T5GCON,3)
// T5GCON<T5GGO_nDONE>
extern volatile __bit                   T5GGO_nDONE         __at(0x7E23);	// @ (0xFC4 * 8 + 3)
#define                                 T5GGO_nDONE_bit     _BIT_ACCESS(T5GCON,3)
// T5GCON<T5GPOL>
extern volatile __bit                   T5GPOL              __at(0x7E26);	// @ (0xFC4 * 8 + 6)
#define                                 T5GPOL_bit          _BIT_ACCESS(T5GCON,6)
// T5GPPS<T5GPPS0>
extern volatile __bit                   T5GPPS0             __at(0x6FD0);	// @ (0xDFA * 8 + 0)
#define                                 T5GPPS0_bit         _BIT_ACCESS(T5GPPS,0)
// T5GPPS<T5GPPS1>
extern volatile __bit                   T5GPPS1             __at(0x6FD1);	// @ (0xDFA * 8 + 1)
#define                                 T5GPPS1_bit         _BIT_ACCESS(T5GPPS,1)
// T5GPPS<T5GPPS2>
extern volatile __bit                   T5GPPS2             __at(0x6FD2);	// @ (0xDFA * 8 + 2)
#define                                 T5GPPS2_bit         _BIT_ACCESS(T5GPPS,2)
// T5GPPS<T5GPPS3>
extern volatile __bit                   T5GPPS3             __at(0x6FD3);	// @ (0xDFA * 8 + 3)
#define                                 T5GPPS3_bit         _BIT_ACCESS(T5GPPS,3)
// T5GPPS<T5GPPS4>
extern volatile __bit                   T5GPPS4             __at(0x6FD4);	// @ (0xDFA * 8 + 4)
#define                                 T5GPPS4_bit         _BIT_ACCESS(T5GPPS,4)
// T5GPPS<T5GPPS5>
extern volatile __bit                   T5GPPS5             __at(0x6FD5);	// @ (0xDFA * 8 + 5)
#define                                 T5GPPS5_bit         _BIT_ACCESS(T5GPPS,5)
// T5GCON<T5GSPM>
extern volatile __bit                   T5GSPM              __at(0x7E24);	// @ (0xFC4 * 8 + 4)
#define                                 T5GSPM_bit          _BIT_ACCESS(T5GCON,4)
// T5GATE<T5GSS0>
extern volatile __bit                   T5GSS0              __at(0x7E28);	// @ (0xFC5 * 8 + 0)
#define                                 T5GSS0_bit          _BIT_ACCESS(T5GATE,0)
// T5GATE<T5GSS1>
extern volatile __bit                   T5GSS1              __at(0x7E29);	// @ (0xFC5 * 8 + 1)
#define                                 T5GSS1_bit          _BIT_ACCESS(T5GATE,1)
// T5GATE<T5GSS2>
extern volatile __bit                   T5GSS2              __at(0x7E2A);	// @ (0xFC5 * 8 + 2)
#define                                 T5GSS2_bit          _BIT_ACCESS(T5GATE,2)
// T5GATE<T5GSS3>
extern volatile __bit                   T5GSS3              __at(0x7E2B);	// @ (0xFC5 * 8 + 3)
#define                                 T5GSS3_bit          _BIT_ACCESS(T5GATE,3)
// T5GCON<T5GTM>
extern volatile __bit                   T5GTM               __at(0x7E25);	// @ (0xFC4 * 8 + 5)
#define                                 T5GTM_bit           _BIT_ACCESS(T5GCON,5)
// T5GCON<T5GVAL>
extern volatile __bit                   T5GVAL              __at(0x7E22);	// @ (0xFC4 * 8 + 2)
#define                                 T5GVAL_bit          _BIT_ACCESS(T5GCON,2)
// T5CON<T5RD16>
extern volatile __bit                   T5RD16              __at(0x7E19);	// @ (0xFC3 * 8 + 1)
#define                                 T5RD16_bit          _BIT_ACCESS(T5CON,1)
// T6HLT<T6CKPOL>
extern volatile __bit                   T6CKPOL             __at(0x7D96);	// @ (0xFB2 * 8 + 6)
#define                                 T6CKPOL_bit         _BIT_ACCESS(T6HLT,6)
// T6CON<T6CKPS0>
extern volatile __bit                   T6CKPS0             __at(0x7D8C);	// @ (0xFB1 * 8 + 4)
#define                                 T6CKPS0_bit         _BIT_ACCESS(T6CON,4)
// T6CON<T6CKPS1>
extern volatile __bit                   T6CKPS1             __at(0x7D8D);	// @ (0xFB1 * 8 + 5)
#define                                 T6CKPS1_bit         _BIT_ACCESS(T6CON,5)
// T6CON<T6CKPS2>
extern volatile __bit                   T6CKPS2             __at(0x7D8E);	// @ (0xFB1 * 8 + 6)
#define                                 T6CKPS2_bit         _BIT_ACCESS(T6CON,6)
// T6HLT<T6CKSYNC>
extern volatile __bit                   T6CKSYNC            __at(0x7D95);	// @ (0xFB2 * 8 + 5)
#define                                 T6CKSYNC_bit        _BIT_ACCESS(T6HLT,5)
// T6CLKCON<T6CS0>
extern volatile __bit                   T6CS0               __at(0x7D98);	// @ (0xFB3 * 8 + 0)
#define                                 T6CS0_bit           _BIT_ACCESS(T6CLKCON,0)
// T6CLKCON<T6CS1>
extern volatile __bit                   T6CS1               __at(0x7D99);	// @ (0xFB3 * 8 + 1)
#define                                 T6CS1_bit           _BIT_ACCESS(T6CLKCON,1)
// T6CLKCON<T6CS2>
extern volatile __bit                   T6CS2               __at(0x7D9A);	// @ (0xFB3 * 8 + 2)
#define                                 T6CS2_bit           _BIT_ACCESS(T6CLKCON,2)
// T6CLKCON<T6CS3>
extern volatile __bit                   T6CS3               __at(0x7D9B);	// @ (0xFB3 * 8 + 3)
#define                                 T6CS3_bit           _BIT_ACCESS(T6CLKCON,3)
// T6INPPS<T6INPPS0>
extern volatile __bit                   T6INPPS0            __at(0x6FF8);	// @ (0xDFF * 8 + 0)
#define                                 T6INPPS0_bit        _BIT_ACCESS(T6INPPS,0)
// T6INPPS<T6INPPS1>
extern volatile __bit                   T6INPPS1            __at(0x6FF9);	// @ (0xDFF * 8 + 1)
#define                                 T6INPPS1_bit        _BIT_ACCESS(T6INPPS,1)
// T6INPPS<T6INPPS2>
extern volatile __bit                   T6INPPS2            __at(0x6FFA);	// @ (0xDFF * 8 + 2)
#define                                 T6INPPS2_bit        _BIT_ACCESS(T6INPPS,2)
// T6INPPS<T6INPPS3>
extern volatile __bit                   T6INPPS3            __at(0x6FFB);	// @ (0xDFF * 8 + 3)
#define                                 T6INPPS3_bit        _BIT_ACCESS(T6INPPS,3)
// T6INPPS<T6INPPS4>
extern volatile __bit                   T6INPPS4            __at(0x6FFC);	// @ (0xDFF * 8 + 4)
#define                                 T6INPPS4_bit        _BIT_ACCESS(T6INPPS,4)
// T6HLT<T6MODE0>
extern volatile __bit                   T6MODE0             __at(0x7D90);	// @ (0xFB2 * 8 + 0)
#define                                 T6MODE0_bit         _BIT_ACCESS(T6HLT,0)
// T6HLT<T6MODE1>
extern volatile __bit                   T6MODE1             __at(0x7D91);	// @ (0xFB2 * 8 + 1)
#define                                 T6MODE1_bit         _BIT_ACCESS(T6HLT,1)
// T6HLT<T6MODE2>
extern volatile __bit                   T6MODE2             __at(0x7D92);	// @ (0xFB2 * 8 + 2)
#define                                 T6MODE2_bit         _BIT_ACCESS(T6HLT,2)
// T6HLT<T6MODE3>
extern volatile __bit                   T6MODE3             __at(0x7D93);	// @ (0xFB2 * 8 + 3)
#define                                 T6MODE3_bit         _BIT_ACCESS(T6HLT,3)
// T6HLT<T6MODE4>
extern volatile __bit                   T6MODE4             __at(0x7D94);	// @ (0xFB2 * 8 + 4)
#define                                 T6MODE4_bit         _BIT_ACCESS(T6HLT,4)
// T6CON<T6ON>
extern volatile __bit                   T6ON                __at(0x7D8F);	// @ (0xFB1 * 8 + 7)
#define                                 T6ON_bit            _BIT_ACCESS(T6CON,7)
// T6CON<T6OUTPS0>
extern volatile __bit                   T6OUTPS0            __at(0x7D88);	// @ (0xFB1 * 8 + 0)
#define                                 T6OUTPS0_bit        _BIT_ACCESS(T6CON,0)
// T6CON<T6OUTPS1>
extern volatile __bit                   T6OUTPS1            __at(0x7D89);	// @ (0xFB1 * 8 + 1)
#define                                 T6OUTPS1_bit        _BIT_ACCESS(T6CON,1)
// T6CON<T6OUTPS2>
extern volatile __bit                   T6OUTPS2            __at(0x7D8A);	// @ (0xFB1 * 8 + 2)
#define                                 T6OUTPS2_bit        _BIT_ACCESS(T6CON,2)
// T6CON<T6OUTPS3>
extern volatile __bit                   T6OUTPS3            __at(0x7D8B);	// @ (0xFB1 * 8 + 3)
#define                                 T6OUTPS3_bit        _BIT_ACCESS(T6CON,3)
// T6HLT<T6PSYNC>
extern volatile __bit                   T6PSYNC             __at(0x7D97);	// @ (0xFB2 * 8 + 7)
#define                                 T6PSYNC_bit         _BIT_ACCESS(T6HLT,7)
// T6RST<T6RSEL0>
extern volatile __bit                   T6RSEL0             __at(0x7DA0);	// @ (0xFB4 * 8 + 0)
#define                                 T6RSEL0_bit         _BIT_ACCESS(T6RST,0)
// T6RST<T6RSEL1>
extern volatile __bit                   T6RSEL1             __at(0x7DA1);	// @ (0xFB4 * 8 + 1)
#define                                 T6RSEL1_bit         _BIT_ACCESS(T6RST,1)
// T6RST<T6RSEL2>
extern volatile __bit                   T6RSEL2             __at(0x7DA2);	// @ (0xFB4 * 8 + 2)
#define                                 T6RSEL2_bit         _BIT_ACCESS(T6RST,2)
// T6RST<T6RSEL3>
extern volatile __bit                   T6RSEL3             __at(0x7DA3);	// @ (0xFB4 * 8 + 3)
#define                                 T6RSEL3_bit         _BIT_ACCESS(T6RST,3)
// T7CKIPPS<T7CKIPPS0>
extern volatile __bit                   T7CKIPPS0           __at(0x6FD8);	// @ (0xDFB * 8 + 0)
#define                                 T7CKIPPS0_bit       _BIT_ACCESS(T7CKIPPS,0)
// T7CKIPPS<T7CKIPPS1>
extern volatile __bit                   T7CKIPPS1           __at(0x6FD9);	// @ (0xDFB * 8 + 1)
#define                                 T7CKIPPS1_bit       _BIT_ACCESS(T7CKIPPS,1)
// T7CKIPPS<T7CKIPPS2>
extern volatile __bit                   T7CKIPPS2           __at(0x6FDA);	// @ (0xDFB * 8 + 2)
#define                                 T7CKIPPS2_bit       _BIT_ACCESS(T7CKIPPS,2)
// T7CKIPPS<T7CKIPPS3>
extern volatile __bit                   T7CKIPPS3           __at(0x6FDB);	// @ (0xDFB * 8 + 3)
#define                                 T7CKIPPS3_bit       _BIT_ACCESS(T7CKIPPS,3)
// T7CKIPPS<T7CKIPPS4>
extern volatile __bit                   T7CKIPPS4           __at(0x6FDC);	// @ (0xDFB * 8 + 4)
#define                                 T7CKIPPS4_bit       _BIT_ACCESS(T7CKIPPS,4)
// T7CKIPPS<T7CKIPPS5>
extern volatile __bit                   T7CKIPPS5           __at(0x6FDD);	// @ (0xDFB * 8 + 5)
#define                                 T7CKIPPS5_bit       _BIT_ACCESS(T7CKIPPS,5)
// T7CON<T7CKPS0>
extern volatile __bit                   T7CKPS0             __at(0x7984);	// @ (0xF30 * 8 + 4)
#define                                 T7CKPS0_bit         _BIT_ACCESS(T7CON,4)
// T7CON<T7CKPS1>
extern volatile __bit                   T7CKPS1             __at(0x7985);	// @ (0xF30 * 8 + 5)
#define                                 T7CKPS1_bit         _BIT_ACCESS(T7CON,5)
// T7CLK<T7CS0>
extern volatile __bit                   T7CS0               __at(0x7998);	// @ (0xF33 * 8 + 0)
#define                                 T7CS0_bit           _BIT_ACCESS(T7CLK,0)
// T7CLK<T7CS1>
extern volatile __bit                   T7CS1               __at(0x7999);	// @ (0xF33 * 8 + 1)
#define                                 T7CS1_bit           _BIT_ACCESS(T7CLK,1)
// T7CLK<T7CS2>
extern volatile __bit                   T7CS2               __at(0x799A);	// @ (0xF33 * 8 + 2)
#define                                 T7CS2_bit           _BIT_ACCESS(T7CLK,2)
// T7CLK<T7CS3>
extern volatile __bit                   T7CS3               __at(0x799B);	// @ (0xF33 * 8 + 3)
#define                                 T7CS3_bit           _BIT_ACCESS(T7CLK,3)
// T7GCON<T7GE>
extern volatile __bit                   T7GE                __at(0x798F);	// @ (0xF31 * 8 + 7)
#define                                 T7GE_bit            _BIT_ACCESS(T7GCON,7)
// T7GCON<T7GGO>
extern volatile __bit                   T7GGO               __at(0x798B);	// @ (0xF31 * 8 + 3)
#define                                 T7GGO_bit           _BIT_ACCESS(T7GCON,3)
// T7GCON<T7GGO_NOT_DONE>
extern volatile __bit                   T7GGO_NOT_DONE      __at(0x798B);	// @ (0xF31 * 8 + 3)
#define                                 T7GGO_NOT_DONE_bit  _BIT_ACCESS(T7GCON,3)
// T7GCON<T7GGO_nDONE>
extern volatile __bit                   T7GGO_nDONE         __at(0x798B);	// @ (0xF31 * 8 + 3)
#define                                 T7GGO_nDONE_bit     _BIT_ACCESS(T7GCON,3)
// T7GCON<T7GPOL>
extern volatile __bit                   T7GPOL              __at(0x798E);	// @ (0xF31 * 8 + 6)
#define                                 T7GPOL_bit          _BIT_ACCESS(T7GCON,6)
// T7GPPS<T7GPPS0>
extern volatile __bit                   T7GPPS0             __at(0x6FE0);	// @ (0xDFC * 8 + 0)
#define                                 T7GPPS0_bit         _BIT_ACCESS(T7GPPS,0)
// T7GPPS<T7GPPS1>
extern volatile __bit                   T7GPPS1             __at(0x6FE1);	// @ (0xDFC * 8 + 1)
#define                                 T7GPPS1_bit         _BIT_ACCESS(T7GPPS,1)
// T7GPPS<T7GPPS2>
extern volatile __bit                   T7GPPS2             __at(0x6FE2);	// @ (0xDFC * 8 + 2)
#define                                 T7GPPS2_bit         _BIT_ACCESS(T7GPPS,2)
// T7GPPS<T7GPPS3>
extern volatile __bit                   T7GPPS3             __at(0x6FE3);	// @ (0xDFC * 8 + 3)
#define                                 T7GPPS3_bit         _BIT_ACCESS(T7GPPS,3)
// T7GPPS<T7GPPS4>
extern volatile __bit                   T7GPPS4             __at(0x6FE4);	// @ (0xDFC * 8 + 4)
#define                                 T7GPPS4_bit         _BIT_ACCESS(T7GPPS,4)
// T7GPPS<T7GPPS5>
extern volatile __bit                   T7GPPS5             __at(0x6FE5);	// @ (0xDFC * 8 + 5)
#define                                 T7GPPS5_bit         _BIT_ACCESS(T7GPPS,5)
// T7GCON<T7GSPM>
extern volatile __bit                   T7GSPM              __at(0x798C);	// @ (0xF31 * 8 + 4)
#define                                 T7GSPM_bit          _BIT_ACCESS(T7GCON,4)
// T7GATE<T7GSS0>
extern volatile __bit                   T7GSS0              __at(0x7990);	// @ (0xF32 * 8 + 0)
#define                                 T7GSS0_bit          _BIT_ACCESS(T7GATE,0)
// T7GATE<T7GSS1>
extern volatile __bit                   T7GSS1              __at(0x7991);	// @ (0xF32 * 8 + 1)
#define                                 T7GSS1_bit          _BIT_ACCESS(T7GATE,1)
// T7GATE<T7GSS2>
extern volatile __bit                   T7GSS2              __at(0x7992);	// @ (0xF32 * 8 + 2)
#define                                 T7GSS2_bit          _BIT_ACCESS(T7GATE,2)
// T7GATE<T7GSS3>
extern volatile __bit                   T7GSS3              __at(0x7993);	// @ (0xF32 * 8 + 3)
#define                                 T7GSS3_bit          _BIT_ACCESS(T7GATE,3)
// T7GATE<T7GSS4>
extern volatile __bit                   T7GSS4              __at(0x7994);	// @ (0xF32 * 8 + 4)
#define                                 T7GSS4_bit          _BIT_ACCESS(T7GATE,4)
